_root.装备生命周期函数.M134暴力版初始化 = function(反射对象, 参数对象)
{
	if (!反射对象.是否为主角)
	{
		var 自机 = 反射对象.自机;
		反射对象.间隔 = 参数对象.interval ? 参数对象.interval : 5000;
    	反射对象.标签 = 参数对象.label ? 参数对象.label :"自动抡枪";
		反射对象.X轴 = 参数对象.x_range ? 参数对象.x_range : 180;
		反射对象.Z轴 = 参数对象.z_range ? 参数对象.z_range : 50;
		反射对象.自动抡枪 = function()
		{
			if (自机.攻击模式 === "长枪" && !自机.倒地 && 自机.状态 != "击倒" && 自机.状态 != "技能")
			{
				var 敌方目标 = _root.gameworld[自机.攻击目标];
				距离X = Math.abs(自机._x - 敌方目标._x);
				距离Z = Math.abs(自机.Z轴坐标 - 敌方目标.Z轴坐标);

				if (距离X < 反射对象.X轴 && 距离Z < 反射对象.Z轴)
				{
					自机.技能名 = "抡枪";
					自机.状态改变("技能");
					自机.man.gotoAndPlay("抡枪");
				}
			}
		};
	}

};

_root.装备生命周期函数.M134暴力版周期 = function(反射对象, 参数对象)
{
	if (!反射对象.是否为主角)
	{
		_root.装备生命周期函数.移除异常周期函数(反射对象);
		_root.更新并执行时间间隔动作(反射对象,反射对象.标签,反射对象.自动抡枪,反射对象.间隔,true,反射对象);
	}

	var target:MovieClip = 反射对象.自机;
	var laser:MovieClip = target.长枪_引用.激光模组;

	laser._visible = (反射对象.自机.攻击模式 === "长枪");
};