// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.Mark3手甲初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    反射对象.射击间隔 = 参数对象.interval ? 参数对象.interval : 1000;
    if(!自机.Mark3消耗能量电池){
        自机.Mark3消耗能量电池 = false;
    }
    if (反射对象.是否为主角 && _root.Mark3消耗能量电池)
    {
        自机.Mark3消耗能量电池 = _root.Mark3消耗能量电池;
    }

};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.Mark3手甲周期 = function(反射对象, 参数对象)
{
	_root.装备生命周期函数.移除异常周期函数(反射对象);
    var 自机 = 反射对象.自机;
    if(自机.攻击模式 == "空手"){
        if(自机.按键检测(_root.武器变形键,0)){
            自机.武器变形键按键中 = true;
        }else if(自机.武器变形键按键中){
            自机.武器变形键按键中 = false;
            自机.Mark3消耗能量电池 = !自机.Mark3消耗能量电池;
            if (反射对象.是否为主角)
            {
                _root.Mark3消耗能量电池 = 自机.Mark3消耗能量电池;
                if(自机.Mark3消耗能量电池){
                    _root.发布消息("开启能量电池消耗！");
                }else{
                    _root.发布消息("关闭能量电池消耗！");
                }
            }
        }
    }
};