// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.九命猫妖初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
    if(!自机.重生次数){
        自机.重生次数 = 0;
    }
    if(!自机.复活累计时间){
        自机.复活累计时间 = 0;
    }
    自机.respawn = true;
};
_root.装备生命周期函数.真九命猫妖初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
    if(参数对象.limit){
        自机.复活上限 = 参数对象.limit;
    }
    if(参数对象.rate){
        自机.复活概率 = 参数对象.rate;
    }
    if(!自机.被动技能){
        自机.被动技能 = {};
    }
    自机.被动技能.拳脚攻击 = {技能名:"拳脚攻击", 等级:10, 启用:true};
    自机.被动技能.内力爆发 = {技能名:"内力爆发", 等级:10, 启用:true};
    自机.被动技能.独行者 = {技能名:"独行者", 等级:10, 启用:true};
};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.九命猫妖周期 = function(反射对象, 参数对象)
{
	_root.装备生命周期函数.移除异常周期函数(反射对象);
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
    var 复活上限 = 自机.复活上限? 自机.复活上限 : 参数对象.limit ? 参数对象.limit : 9;
    var 概率 = 自机.复活概率? 自机.复活概率 : 参数对象.rate ? 参数对象.rate : 10;
   if (自机.hp <= 1)
   {
        自机.复活累计时间 ++;
        if(自机.复活累计时间 < 3 && 自机.重生次数 < 复活上限 && _root.成功率(概率)){
            自机.hp = 自机.hp满血值;
            自机.重生次数 ++;
            自机.技能等级 = Math.min(Math.ceil(自机.等级 / 10), 10);
            _root.技能路由.技能标签跳转_旧(自机, "扭转乾坤");
        }
   }else{
        自机.复活累计时间 = 0;
   }
};
