// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.九命猫妖初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
    if(!自机.重生次数){
        自机.重生次数 = 0;
    }
    自机.respawn = true;
};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.九命猫妖周期 = function(反射对象, 参数对象)
{
	_root.装备生命周期函数.移除异常周期函数(反射对象);
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
     var 复活上限 =  参数对象.limit ? 参数对象.limit : 9;
     var 概率 =  参数对象.rate ? 参数对象.rate : 10;
   if (自机.hp <= 1 && 自机.重生次数 < 复活上限 && _root.成功率(概率))
   {
        自机.hp = 自机.hp满血值;
        自机.重生次数 ++;
        _root.技能路由.技能标签跳转_旧(自机, "扭转乾坤");
   }
};
