// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.喷气背包初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    // 反射对象.喷火x = 参数对象.x ? 参数对象.x : -100;
    // 反射对象.喷火y = 参数对象.y ? 参数对象.y : 112;
    // if(!自机.背包喷火暂定){
    //     自机.背包喷火暂定 = 自机.attachMovie("背包喷火暂定","背包喷火暂定",自机.getNextHighestDepth(),{_x:反射对象.喷火x, _y:反射对象.喷火y});
    //     //自机.背包喷火暂定._visible = false;
    //     自机.背包喷火暂定.残留帧 = 0;
    // }
    参数对象 = 参数对象 || {};
    参数对象.type = "身体_引用";  // 设定物件类型
    参数对象.object = "背包喷火暂定";  // 设定物件种类
    _root.装备生命周期函数.挂载背景物件初始化(反射对象, 参数对象);
    反射对象.物件._visible = false;
    反射对象.物件.残留帧 = 0;
    反射对象.物件._x = 参数对象.x ? 参数对象.x : -20;
    反射对象.物件._y = 参数对象.y ? 参数对象.y : -80;
    if(自机.hp > 0)
    {
        自机.jetpackCheck();
    }
};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.喷气背包周期 = function(反射对象, 参数对象)
{
	//_root.装备生命周期函数.移除异常周期函数(反射对象);
    _root.装备生命周期函数.挂载背景物件周期(反射对象, 参数对象);
    反射对象.物件._x = 参数对象.x ? 参数对象.x : -20;
    反射对象.物件._y = 参数对象.y ? 参数对象.y : -80;
    var 自机 = 反射对象.自机;
   if(自机.正在充气 == 0 || 自机.正在充气 == 1)
   {
      反射对象.物件._visible = true;
      反射对象.物件.残留帧 = 5;
   }
   else
   {
      if(反射对象.物件.残留帧 >= 0)
      {
         反射对象.物件.残留帧--;
      }
      if(反射对象.物件.残留帧 == 0)
      {
         反射对象.物件._visible = false;
      }
   }
   if(自机.hp > 0)
   {
      自机.jetpackCheck();
   }
};