// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.喷气背包初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    反射对象.x = 参数对象.x ? 参数对象.x : -95;
    反射对象.y = 参数对象.y ? 参数对象.y : 231;
    if (反射对象.是否为主角 && _root.Mark3消耗能量电池)
    {
        自机.Mark3消耗能量电池 = _root.Mark3消耗能量电池;
    }

};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.喷气背包周期 = function(反射对象, 参数对象)
{};