// ============================================================
// 初始化
// ============================================================


_root.装备生命周期函数.蜘蛛侠蛛丝初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    var 防具技能冷却 = 参数对象.cd ? 参数对象.cd : 1000;
    自机.防具技能使用次数 = 自机.防具技能使用次数 ? 自机.防具技能使用次数 : 0;
    自机.防具技能冷却时长 = 自机.防具技能冷却时长 ? 自机.防具技能冷却时长 : 防具技能冷却;

};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.蜘蛛侠蛛丝周期 = function(反射对象, 参数对象)
{
	_root.装备生命周期函数.移除异常周期函数(反射对象);
    var 自机 = 反射对象.自机;
    var 防具技能上限 = 参数对象.limit ? 参数对象.limit : 5;
    var 防具技能冷却 = 参数对象.cd ? 参数对象.cd : 1000;
    自机.防具技能冷却时长 += 33;
    if(自机.防具技能使用次数 < 防具技能上限 && 自机.防具技能冷却时长 >= 防具技能冷却 && 自机.按键检测(_root.飞行键,5)){
        var 减速持续时间 = 参数对象.frames ? 参数对象.frames : 90;
        自机.防具技能使用次数 ++;
        自机.防具技能冷却时长 = 0;
        自机.手部发射子弹属性 = {
            子弹种类: "蜘蛛网",
            声音: "单发暗器二.mp3",
            子弹威力: 自机.空手攻击力,
            子弹速度: 25,
            Z轴攻击范围: 50,
            击倒率:2,
            击中时触发函数:function(){
                var 暂存敌人 = this.命中对象;
                var childBuffs:Array = [
                    new PodBuff("行走X速度", BuffCalculationType.MULT_POSITIVE, 0.1)
                ];

                // 时间限制
                var timeLimitComp:TimeLimitComponent = new TimeLimitComponent(减速持续时间);
                var components:Array = [timeLimitComp];

                var metaBuff:MetaBuff = new MetaBuff(childBuffs, components, 0);
                暂存敌人.buffManager.addBuff(metaBuff, "蜘蛛网");
                if (!this.已爆炸)
                {
                    this.已爆炸 = true;
                    //this.伤害类型 = "真伤";
                    this.xmov = 0;
                    this.ymov = 0;
                    gotoAndPlay("爆炸");
                }
            }
        };
        _root.战技路由.战技标签跳转_旧(自机, "手部发射");
    }
};