// ============================================================
// 初始化
// ============================================================

_root.装备生命周期函数.贯空天盖手套初始化 =  function(反射对象, 参数对象)
{
    var 自机 = 反射对象.自机;
    参数对象 = 参数对象 || {};
};

// ============================================================
// 周期
// ============================================================
_root.装备生命周期函数.贯空天盖手套周期 = function(反射对象, 参数对象)
{
	_root.装备生命周期函数.移除异常周期函数(反射对象);
    var 自机 = 反射对象.自机;
   if (自机._name == _root.控制目标 && 自机.攻击模式 === "空手")
   {
      var 装备栏 = _root.物品栏.装备栏;
      var 头部装备 = 装备栏.getNameString("头部装备");
      var 上装装备 = 装备栏.getNameString("上装装备");
      var 战技列表 = ["咒针","伸手及月"];
      if(头部装备 == "登上明星"){
         战技列表.push("登上明星");
      }
      if(上装装备 == "贯空天盖上衣"){
         战技列表.push("回归枢机之光");
      }
      if(!装备栏.getItem("手部装备").value.当前战技){
         装备栏.getItem("手部装备").value.当前战技 = 0;
      }
		if (Key.isDown(_root.武器变形键))
		{
			if (!按键中)
			{
            装备栏.getItem("手部装备").value.当前战技 += 1;
				if (装备栏.getItem("手部装备").value.当前战技 >= 战技列表.length)
				{
					装备栏.getItem("手部装备").value.当前战技 = 0;
				}
				if (装备栏.getItem("手部装备").value.当前战技 == 3 && 自机.回归枢机之光发射数 && 自机.回归枢机之光发射数 >= 5)
				{
					装备栏.getItem("手部装备").value.当前战技 = 0;
               _root.发布消息("[回归枢机之光]发射数已达到本张地图的上限，当前战技切换为["+ 战技列表[装备栏.getItem("手部装备").value.当前战技] + "]");
				}else{
               _root.发布消息("当前战技切换为["+ 战技列表[装备栏.getItem("手部装备").value.当前战技] + "]");
            }
			}
			按键中 = true;
		}
		else
		{
			按键中 = false;
		}
   }
};