import org.flashNight.sara.util.AABB;

// ============================================================================
// IBVHObject - BVH对象接口
// ----------------------------------------------------------------------------
// 定义了可以被添加到 BVH 树中的对象必须实现的接口。
// 任何希望被空间数据结构管理的对象都应该实现此接口。
// ============================================================================

interface org.flashNight.naki.DataStructures.IBVHObject {
    /**
     * 获取对象的轴对齐包围盒（AABB）。
     * BVH 将使用此 AABB 来确定对象在空间中的位置和范围。
     * @return {AABB} 对象的包围盒。
     */
    function getAABB():AABB;
}