import org.flashNight.naki.RandomNumberEngine.*;

_root.生成游戏世界可雇用敌人 = function(添加佣兵函数, 机率, 是否门口)
{
	_root.刷新受雇欲望基准();//小塞一下刷新函数
	var 场上佣兵总人数 = _root.成功率(100 / 机率) ? _root.随机整数(1, 3) : 0.5;
	var 面积系数 = (_root.Xmax - _root.Xmin) * (_root.Ymax - _root.Ymin) / _root.面积系数;
	面积系数 *= 1.5; //

	场上佣兵总人数 = Math.floor(Math.max(场上佣兵总人数 * 面积系数, 1));

	var 已上场佣兵编号 = [];
	if(isNaN(_root.gameworld.可雇用敌人在场数量)) _root.gameworld.可雇用敌人在场数量 = 0;

	for (var 迭代器 = 0; 迭代器 < 场上佣兵总人数; 迭代器++)
	{
		if(_root.gameworld.可雇用敌人在场数量 >= 场上佣兵总人数){
			break;
		}

		if (是否门口){
			var 门名单 = [];
			for (var 单位 in _root.gameworld){
				if (_root.gameworld[单位].是否从门加载主角)
				{
					门名单.push(_root.gameworld[单位]._name);
				}
			}
			var 刷佣兵的门 = _root.随机选择数组元素(门名单);
			添加佣兵函数(_root.gameworld[刷佣兵的门]._x,_root.gameworld[刷佣兵的门]._y);
		}
		else
		{
			添加佣兵函数();
		}
	}
};

_root.门口刷可雇用敌人 = function()
{
	_root.生成游戏世界可雇用敌人(_root.添加门口可雇用敌人,1,true);
};

_root.场景刷可雇用敌人 = function(机率)
{
	_root.生成游戏世界可雇用敌人(_root.添加场上可雇用敌人,机率,false);
};

_root.添加门口可雇用敌人 = function(X, Y){
	// 暂时硬代码加一下主线限制
	var 敌人列表 = _root.可雇佣敌人列表;
	if(_root.主线任务进度 < 57){
		敌人列表 = 敌人列表.slice(0,15);
	}
	var 敌人权重表 = new Array(敌人列表.length);
	for(var i=0; i<敌人列表.length;i++){
		敌人权重表[i] = 敌人列表[i].权重;
	}
	var 佣兵数据 = LinearCongruentialEngine.getInstance().getWeightedRandomElement(敌人列表, 敌人权重表);
	_root.创建可雇用敌人实体对象(佣兵数据,X,Y);
};

_root.添加场上可雇用敌人 = function(){
	// 暂时硬代码加一下主线限制
	var 敌人列表 = _root.可雇佣敌人列表;
	if(_root.主线任务进度 < 57){
		敌人列表 = 敌人列表.slice(0,15);
	}
	var 敌人权重表 = new Array(敌人列表.length);
	for(var i=0; i<敌人列表.length;i++){
		敌人权重表[i] = 敌人列表[i].权重;
	}
	var 佣兵数据 = LinearCongruentialEngine.getInstance().getWeightedRandomElement(敌人列表, 敌人权重表);
	var obj = _root.场景随机有效位置();
	_root.创建可雇用敌人实体对象(佣兵数据,obj.x,obj.y);
};

_root.创建可雇用敌人实体对象 = function(佣兵数据, X, Y)
{
	if (!佣兵数据.兵种) return null;                                                                                                                                                         

	生成佣兵计数++;
	var 佣兵名 = "佣兵" + 佣兵数据.兵种 + 生成佣兵计数;// 根据佣兵数据生成唯一的佣兵名

	// 在游戏世界中创建佣兵对象
	var 兵种 = 佣兵数据.兵种;
	var 佣兵对象 = _root.加载游戏世界人物(兵种, 佣兵名, _root.gameworld.getNextHighestDepth(), {_x:X, _y:Y});

	// 设置佣兵对象的各项属性
	// 佣兵对象.佣兵库编号 = 佣兵数据.编号;
	佣兵对象.是否为敌人 = false;
	佣兵对象.兵种 = 佣兵数据.兵种;
	佣兵对象.名字 = 佣兵数据.名字;
	佣兵对象.身高 = 佣兵数据.身高;
	佣兵对象.性别 = 佣兵数据.性别;
	佣兵对象.NPC = true;

	// 随机设置佣兵的方向
	佣兵对象.方向 = _root.成功率(50) ? "左" : "右";

	// 设置佣兵对象的佣兵数据
	佣兵对象.佣兵数据 = 佣兵数据;

	佣兵对象.等级 = _root.随机整数(1,25);

	佣兵对象.默认对话 = [[]];
	var 随机对话编号 = _root.获取随机索引(_root.非人形佣兵随机对话[佣兵数据.身份]);
	var 随机对话 = _root.非人形佣兵随机对话[佣兵数据.身份][随机对话编号];
	佣兵对象.受雇欲望 = _root.随机整数(10 * 随机对话.MinIntention, 10 * 随机对话.MaxIntention) * 0.1;

	var 受雇意向描述 = "迫不及待";
	if(佣兵对象.受雇欲望 < 0.5) 受雇意向描述 = "无";
	else if(佣兵对象.受雇欲望 < 1.5) 受雇意向描述 = "些微";
	else if(佣兵对象.受雇欲望 < 2.5) 受雇意向描述 = "低";
	else if(佣兵对象.受雇欲望 < 3.5) 受雇意向描述 = "中";
	else if(佣兵对象.受雇欲望 < 4.5) 受雇意向描述 = "高";

	var 随机对话内容 = 随机对话.Text + "（受雇意向：" + 受雇意向描述 + "）";
	佣兵对象.默认对话[0][0] = [佣兵数据.名字, 佣兵数据.身份, "堕落城盗贼", 随机对话内容, 佣兵数据.名字];

	_root.计算可雇用敌人价格(佣兵对象);
	
	佣兵对象.删除可雇用单位 = function(){
		_root.gameworld.可雇用敌人在场数量--;
		this.removeMovieClip();
	}

	佣兵对象.area.onRelease = function(){
		_root.NPC功能菜单._visible = true;
		_root.NPC功能菜单._x = _root._xmouse;
		_root.NPC功能菜单._y = _root._ymouse;
		_root.NPC功能菜单.当前NPC = _parent._name;
		_root.NPC功能菜单.刷新显示();
	}

	_root.gameworld.可雇用敌人在场数量++;
	return 佣兵对象;// 返回创建的佣兵对象
};

_root.计算可雇用敌人价格 = function(佣兵对象){
	var 战宠编号 = 佣兵对象.佣兵数据.战宠编号;
	if(isNaN(战宠编号)) return;
	var 宠物数据 = _root.宠物库[战宠编号];
	if(宠物数据.KPrice > 0) return;

	if(佣兵对象.受雇欲望 < (_root.受雇欲望基准 - 1)) return; //受雇欲望大于基准-1才能雇佣

	var 基础价格 = 宠物数据.Price * 0.75 + 宠物数据.IncreasePrice * 0.25; //按售价和涨价决定基础价格
	var 等级增幅 = 25 * 佣兵对象.等级 * 佣兵对象.等级 + 0.04 * 宠物数据.Price * 佣兵对象.等级; //随等级二次增长
	var 受雇欲望乘数 = 1 + Math.max(_root.受雇欲望基准 - 佣兵对象.受雇欲望, -1) * 0.5; //随着受雇欲望影响 价格在50%-150%之间浮动

	var 最终价格 = Math.floor((基础价格 + 等级增幅) * 受雇欲望乘数);
	最终价格 -= 最终价格 % 10; //抹个零头
	佣兵对象.雇佣价格 = 最终价格;
	佣兵对象.宠物数据 = [
		战宠编号,
		佣兵对象.等级,//初始等级
		50 + 2 * _root.随机整数(0,50), //体力
		0, // 没p用的k点售价
		1, //是否出战
		{} //额外数据
	];
}

//计划初始值为4.5，随着玩家口才升级最终达到1.5
_root.刷新受雇欲望基准 = function(){
	if(_root.主角被动技能.口才 && _root.主角被动技能.口才.启用){
		_root.受雇欲望基准 = 4.5 - _root.主角被动技能.口才.等级 * 0.3;
		if(_root.受雇欲望基准 <= 1.5) _root.受雇欲望基准 = 1.5;
	}else{
		_root.受雇欲望基准 = 4.5;
	}
}

_root.受雇欲望基准 = 4.5;



_root.可雇佣敌人列表 = new Array(17);

_root.可雇佣敌人列表[0] = {兵种:"敌人-盗贼大叔", 名字:"铁拳", 身高:195, 性别:"男", 身份:"游寇", 战宠编号:4, 权重: 5};
_root.可雇佣敌人列表[1] = {兵种:"敌人-盗贼侏儒", 名字:"跳蚤", 身高:175, 性别:"男", 身份:"游寇", 战宠编号:5, 权重: 8};
_root.可雇佣敌人列表[2] = {兵种:"敌人-盗贼瘦子", 名字:"杀手", 身高:175, 性别:"男", 身份:"游寇", 战宠编号:6, 权重: 8};
_root.可雇佣敌人列表[3] = {兵种:"敌人-盗贼枪手", 名字:"左轮", 身高:175, 性别:"男", 身份:"游寇", 战宠编号:80, 权重: 8};
_root.可雇佣敌人列表[4] = {兵种:"敌人-狂野玫瑰马尾姑娘", 名字:"街舞少女", 身高:175, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:7, 权重: 6};
_root.可雇佣敌人列表[5] = {兵种:"敌人-辫子姑娘", 名字:"战斗少女", 身高:175, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:8, 权重: 6};
_root.可雇佣敌人列表[6] = {兵种:"敌人-黑铁会死士", 名字:"黑铁死士", 身高:175, 性别:"男", 身份:"黑铁会部众", 战宠编号:9, 权重: 6};
_root.可雇佣敌人列表[7] = {兵种:"敌人-黑铁会刺客", 名字:"黑铁刺客", 身高:175, 性别:"男", 身份:"黑铁会部众", 战宠编号:10, 权重: 5};
_root.可雇佣敌人列表[8] = {兵种:"敌人-黑铁会大叔", 名字:"黑铁大叔", 身高:185, 性别:"男", 身份:"黑铁会部众", 战宠编号:11, 权重: 5};
_root.可雇佣敌人列表[9] = {兵种:"敌人-劫掠少女", 名字:"掠夺少女", 身高:176, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:95, 权重: 4};

_root.可雇佣敌人列表[10] = {兵种:"敌人-黑铁死士精英", 名字:"黑铁游侠", 身高:175, 性别:"男", 身份:"黑铁会精英", 战宠编号:86, 权重: 2};
_root.可雇佣敌人列表[11] = {兵种:"敌人-精英战术少女", 名字:"精英战术少女", 身高:165, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:71, 权重: 3};
_root.可雇佣敌人列表[12] = {兵种:"敌人-双喷少女", 名字:"摇滚学姐", 身高:175, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:72, 权重: 2};
_root.可雇佣敌人列表[13] = {兵种:"敌人-刀狙少女", 名字:"精锐掠夺少女", 身高:180, 性别:"女", 身份:"狂野玫瑰成员", 战宠编号:96, 权重: 2};
_root.可雇佣敌人列表[14] = {兵种:"敌人-黑铁精英流锤兵", 名字:"黑铁流锤", 身高:175, 性别:"男", 身份:"黑铁会精英", 战宠编号:87, 权重: 2};

_root.可雇佣敌人列表[15] = {兵种:"敌人-黑铁重锤", 名字:"黑铁重锤", 身高:190, 性别:"男", 身份:"黑铁会精英", 战宠编号:76, 权重: 1};
_root.可雇佣敌人列表[16] = {兵种:"敌人-黑铁武士", 名字:"黑铁武士", 身高:175, 性别:"男", 身份:"黑铁会精英", 战宠编号:88, 权重: 1};
