/*
_root.属性武器改装清单 = [];
_root.属性武器改装清单.push([70000,"Glock18墨冰","Glock18墨冰改装图纸",[["Glock18墨冰改装图纸",1],["Glock 18",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([100000,"MP40墨冰","MP40墨冰改装图纸",[["MP40墨冰改装图纸",1],["MP40",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([70000,"Beretta90TWO墨冰","Beretta90TWO墨冰图纸",[["Beretta90TWO墨冰图纸",1],["Beretta90TWO",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([80000,"TTI2011墨冰","TTI2011墨冰图纸",[["TTI2011墨冰图纸",1],["TTI 2011 Combat Master",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([70000,"MK23墨冰","MK23墨冰图纸",[["MK23墨冰图纸",1],["MK23手枪",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([130000,"韦森686墨冰","韦森686墨冰图纸",[["韦森686墨冰图纸",1],["韦森686",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([160000,"AK74墨冰","AK74墨冰改装图纸",[["AK74墨冰改装图纸",1],["AK74",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([180000,"M4A1墨冰","M4A1墨冰改装图纸",[["M4A1墨冰改装图纸",1],["M4A1",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([190000,"AUG墨冰","AUG墨冰改装图纸",[["AUG墨冰改装图纸",1],["AUG",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([160000,"HK416墨冰","HK416墨冰图纸",[["HK416墨冰图纸",1],["HK416",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([210000,"53式步骑枪墨冰","53式步骑枪墨冰改装图纸",[["53式步骑枪墨冰改装图纸",1],["53式步骑枪",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([500000,"Sniper墨冰","Sniper墨冰改装图纸",[["Sniper墨冰改装图纸",1],["Sniper",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([400000,"SVD墨冰","SVD墨冰改装图纸",[["SVD墨冰改装图纸",1],["SVD",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([640000,"M14墨冰","M14墨冰图纸",[["M14墨冰图纸",1],["m14",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([650000,"墨冰88式狙击枪","墨冰88式狙击枪图纸",[["墨冰88式狙击枪图纸",1],["中国88式狙击步枪",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([400000,"XM1014墨冰","XM1014墨冰图纸",[["XM1014墨冰图纸",1],["XM1014",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([500000,"墨冰白火铳","墨冰白火铳图纸",[["墨冰白火铳图纸",1],["白火铳",1],["上色涂料",10],["枪械内构强化套件",10],["水冷机构",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([80000,"墨冰匕首","墨冰匕首改装图纸",[["墨冰匕首改装图纸",1],["匕首",1],["上色涂料",10],["高强度合金",10],["石英磨刀石",10],["水冷机构",10]],0]);
_root.属性武器改装清单.push([240000,"墨冰大剑","墨冰大剑改装图纸",[["墨冰大剑改装图纸",1],["大剑",1],["上色涂料",10],["高强度合金",10],["石英磨刀石",10],["水冷机构",10]],0]);
_root.属性武器改装清单.push([999999,"待加入","待加入",[["待加入",1]],999999]);

_root.属性武器改装清单.push([70000,"Glock18狱火","Glock18狱火改装图纸",[["Glock18狱火改装图纸",1],["Glock 18",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([100000,"MP40狱火","MP40狱火改装图纸",[["MP40狱火改装图纸",1],["MP40",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([70000,"Beretta90TWO狱火","Beretta90TWO狱火图纸",[["Beretta90TWO狱火图纸",1],["Beretta90TWO",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([80000,"TTI2011狱火","TTI2011狱火图纸",[["TTI2011狱火图纸",1],["TTI 2011 Combat Master",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([70000,"MK23狱火","MK23狱火图纸",[["MK23狱火图纸",1],["MK23手枪",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([130000,"韦森686狱火","韦森686狱火图纸",[["韦森686狱火图纸",1],["韦森686",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([160000,"AK74狱火","AK74狱火改装图纸",[["AK74狱火改装图纸",1],["AK74",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([180000,"M4A1狱火","M4A1狱火改装图纸",[["M4A1狱火改装图纸",1],["M4A1",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([190000,"AUG狱火","AUG狱火改装图纸",[["AUG狱火改装图纸",1],["AUG",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([160000,"HK416狱火","HK416狱火图纸",[["HK416狱火图纸",1],["HK416",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([210000,"53式步骑枪狱火","53式步骑枪狱火改装图纸",[["53式步骑枪狱火改装图纸",1],["53式步骑枪",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([500000,"Sniper狱火","Sniper狱火改装图纸",[["Sniper狱火改装图纸",1],["Sniper",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([400000,"SVD狱火","SVD狱火改装图纸",[["SVD狱火改装图纸",1],["SVD",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([640000,"M14狱火","M14狱火图纸",[["M14狱火图纸",1],["m14",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([650000,"狱火88式狙击枪","狱火88式狙击枪图纸",[["狱火88式狙击枪图纸",1],["中国88式狙击步枪",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([400000,"XM1014狱火","XM1014狱火图纸",[["XM1014狱火图纸",1],["XM1014",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([500000,"狱火白火铳","狱火白火铳图纸",[["狱火白火铳图纸",1],["白火铳",1],["上色涂料",10],["枪械内构强化套件",10],["传感器",10],["非栓式机构",10]],0]);
_root.属性武器改装清单.push([80000,"狱火匕首","狱火匕首改装图纸",[["狱火匕首改装图纸",1],["匕首",1],["上色涂料",10],["高强度合金",10],["石英磨刀石",10],["传感器",10]],0]);
_root.属性武器改装清单.push([240000,"狱火大剑","狱火大剑改装图纸",[["狱火大剑改装图纸",1],["大剑",1],["上色涂料",10],["高强度合金",10],["石英磨刀石",10],["传感器",10]],0]);
_root.属性武器改装清单.push([999999,"待加入","待加入",[["待加入",1]],999999]);


_root.改装清单 = [];
_root.改装清单.push([15000,"剑圣头部装甲","剑圣头部装甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"剑圣胸甲","剑圣胸甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"剑圣手甲","剑圣手甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"剑圣腿甲","剑圣腿甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"剑圣装甲鞋","剑圣装甲鞋改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"般若影鬼半覆面","剑圣头部装甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([15000,"般若赤鬼半覆面","剑圣头部装甲改装图纸",[["剑圣碎片",5]],0]);
_root.改装清单.push([50000,"秋月","秋月改装图纸",[["月之碎片",15]],0]);
_root.改装清单.push([5000,"镜之虎彻","镜之虎彻改装图纸",[["镜之虎彻制作图纸",1],["虎彻",1],["不锈钢材",30],["高强度合金",10],["石英磨刀石",20],["战术握把",2],["水冷机构",2]],0]);
_root.改装清单.push([5000,"加强版mp7","加强版MP7改装图纸",[["加强版MP7制作图纸",1],["MP7",1],["复合式军用塑料",5],["枪械内构强化套件",5],["加长弹匣",1],["镭射瞄准具",1]],0]);
_root.改装清单.push([2000,"精致战术猪鼻式防毒面具","精致战术猪鼻式防毒面具改装图纸",[["精致战术猪鼻式防毒面具制作图纸",1],["战术猪鼻式防毒面具",1],["军用帆布",5],["碳纤维布料",1]],0]);
_root.改装清单.push([2000,"A兵团精致战术背心","A兵团精致战术背心改装图纸",[["A兵团精致战术背心制作图纸",1],["A兵团制式战术背心",1],["军用帆布",5],["碳纤维布料",1]],0]);
_root.改装清单.push([2000,"A兵团精致战术手套","A兵团精致战术手套改装图纸",[["A兵团精致战术手套制作图纸",1],["A兵团制式战术手套",1],["军用帆布",5],["碳纤维布料",1]],0]);
_root.改装清单.push([2000,"A兵团精致战术裤","A兵团精致战术裤改装图纸",[["A兵团精致战术裤制作图纸",1],["A兵团制式战术裤",1],["军用帆布",5],["碳纤维布料",1]],0]);
_root.改装清单.push([2000,"A兵团精致战术皮鞋","A兵团精致战术皮鞋改装图纸",[["A兵团精致战术皮鞋制作图纸",1],["A兵团制式战术皮鞋",1],["军用帆布",5],["碳纤维布料",1]],0]);
_root.改装清单.push([5000,"A兵团精致项链","A兵团精致项链改装图纸",[["A兵团精致项链制作图纸",1],["A兵团项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([16000,"冷兵器中加成项链","冷兵器中加成项链改装图纸",[["冷兵器小加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([16000,"枪械中加成项链","枪械中加成项链改装图纸",[["枪械小加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([16000,"空手中加成项链","空手中加成项链改装图纸",[["空手小加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([50000,"XM1014战术版","XM1014改装图纸",[["XM1014",1],["弹簧",5],["烈性火药",5],["不锈钢材",5],["枪械内构强化套件",5],["战术握把",2],["突击型光学瞄具",2]],0]);
_root.改装清单.push([12500,"钢铁小熊头","仿生甲头盔图纸",[["不锈钢材",20],["高强度合金",10],["螺丝套件",20]],800]);
_root.改装清单.push([12500,"钢铁小熊上装","仿生甲胸甲图纸",[["高强度合金",20],["可塑式钢板",10],["螺丝套件",10]],800]);
_root.改装清单.push([12500,"钢铁小熊手套","仿生甲手甲图纸",[["碳纤维布料",15],["高强度合金",10],["螺丝套件",10]],800]);
_root.改装清单.push([12500,"钢铁小熊下装","仿生甲兜甲图纸",[["高强度合金",10],["螺丝套件",10],["可塑式钢板",10]],800]);
_root.改装清单.push([12500,"钢铁小熊鞋","仿生机腿甲图纸",[["碳纤维布料",5],["高强度合金",10],["螺丝套件",10]],800]);
_root.改装清单.push([5000,"圣诞帽","圣诞帽改装图纸",[["圣诞糖果",50]],0]);
_root.改装清单.push([5000,"圣诞糖果枪","圣诞糖果枪改装图纸",[["圣诞糖果",90]],0]);
_root.改装清单.push([80000,"Desert Eagle改装版","Desert Eagle改装图纸",[["Desert Eagle",1],["战术导轨",1],["上色涂料",1],["小型液晶屏",1],["碳纤维布料",1]],0]);
_root.改装清单.push([38000,"韦森686改装版","韦森686制作图纸",[["韦森686",1],["螺丝套件",6],["弹簧",3],["战术导轨",1],["枪械内构强化套件",3]],0]);
_root.改装清单.push([55000,"Colt Anaconda","Colt Anaconda制作图纸",[["COLT PYTHON",1],["螺丝套件",2],["弹簧",2],["战术导轨",1],["动力液压杆",1]],0]);
_root.改装清单.push([24000,"白无常礼服","白无常礼服改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1],["增效剂",1]],0]);
_root.改装清单.push([24000,"白无常手套","白无常手套改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1],["增效剂",1]],0]);
_root.改装清单.push([24000,"白无常礼裤","白无常礼裤改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1],["增效剂",1]],0]);
_root.改装清单.push([24000,"白无常鞋子","白无常鞋子改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1],["增效剂",1]],0]);
_root.改装清单.push([10000,"黑无常礼服","黑无常礼服改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1]],0]);
_root.改装清单.push([10000,"黑无常手套","黑无常手套改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1]],0]);
_root.改装清单.push([10000,"黑无常礼裤","黑无常礼裤改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1]],0]);
_root.改装清单.push([10000,"黑无常鞋子","黑无常鞋子改装图纸",[["浮士德装备碎片",5],["碳纤维布料",1]],0]);
_root.改装清单.push([10000,"穿刺QBZ95","穿刺QBZ95改装图纸",[["QBZ95",1],["高强度合金",5],["枪械内构强化套件",5],["强化金属管",5],["突击型光学瞄具",2]],5000]);
_root.改装清单.push([10000,"穿刺LS06","穿刺LS06改装图纸",[["LS06",2],["高强度合金",5],["枪械内构强化套件",5],["强化金属管",5],["镭射瞄准具",2]],3000]);
_root.改装清单.push([40000,"黑龙头盔","黑龙头盔改装图纸",[["黑龙装备碎片",5],["高强度合金",5],["碳纤维布料",1],["螺丝套件",5]],0]);
_root.改装清单.push([40000,"黑龙盔甲","黑龙盔甲改装图纸",[["黑龙装备碎片",5],["高强度合金",5],["碳纤维布料",1],["螺丝套件",5]],0]);
_root.改装清单.push([40000,"黑龙手甲","黑龙手甲改装图纸",[["黑龙装备碎片",5],["高强度合金",5],["碳纤维布料",1],["螺丝套件",5]],0]);
_root.改装清单.push([40000,"黑龙腿甲","黑龙腿甲改装图纸",[["黑龙装备碎片",5],["高强度合金",5],["碳纤维布料",1],["螺丝套件",5]],0]);
_root.改装清单.push([40000,"黑龙战靴","黑龙战靴改装图纸",[["黑龙装备碎片",5],["高强度合金",5],["碳纤维布料",1],["螺丝套件",5]],0]);
_root.改装清单.push([40000,"黑铁耳坠","黑铁耳坠改装图纸",[["黑铁装备碎片",5],["高强度合金",5],["碳纤维布料",10]],0]);
_root.改装清单.push([40000,"黑铁劲装","黑铁劲装改装图纸",[["黑铁装备碎片",5],["高强度合金",5],["碳纤维布料",10]],0]);
_root.改装清单.push([40000,"黑铁手镯","黑铁手镯改装图纸",[["黑铁装备碎片",5],["高强度合金",5],["碳纤维布料",10]],0]);
_root.改装清单.push([40000,"黑铁长裤","黑铁长裤改装图纸",[["黑铁装备碎片",5],["高强度合金",5],["碳纤维布料",10]],0]);
_root.改装清单.push([40000,"黑铁布鞋","黑铁布鞋改装图纸",[["黑铁装备碎片",5],["高强度合金",5],["碳纤维布料",10]],0]);
_root.改装清单.push([10000,"战斗狂人军牌","战斗狂人军牌改装图纸",[["战斗专家军牌",1],["高强度合金",10],["不锈钢材",10],["碳纤维布料",2]],0]);
_root.改装清单.push([10000,"冷兵器大加成项链","冷兵器大加成项链改装图纸",[["冷兵器中加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([10000,"枪械大加成项链","枪械大加成项链改装图纸",[["枪械中加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([10000,"空手大加成项链","空手大加成项链改装图纸",[["空手中加成项链",1],["高强度合金",10],["高耐力橡胶",10]],0]);
_root.改装清单.push([888,"极品UZI战术版","极品UZI战术版打造图纸",[["UZI战术版",1]],4999]);
_root.改装清单.push([10000,"牛仔上衣","牛仔上衣改装图纸",[["牛仔装备碎片",5],["碳纤维布料",1],["战术背带",1],["防沙皮革",1]],0]);
_root.改装清单.push([10000,"牛仔手套","牛仔手套改装图纸",[["牛仔装备碎片",5],["碳纤维布料",1],["战术背带",1],["防沙皮革",1]],0]);
_root.改装清单.push([10000,"牛仔裤子","牛仔裤子改装图纸",[["牛仔装备碎片",5],["碳纤维布料",1],["战术背带",1],["防沙皮革",1]],0]);
_root.改装清单.push([10000,"牛仔皮鞋","牛仔皮鞋改装图纸",[["牛仔装备碎片",5],["碳纤维布料",1],["战术背带",1],["防沙皮革",1]],0]);
_root.改装清单.push([60000,"AK74战术版","AK74改装图纸",[["AK74",1],["战术版AK200",1],["战术导轨",5],["高强度合金",5],["强化金属管",5],["枪械内构强化套件",5],["烈性火药",10],["传动装置",2],["镭射瞄准具",2]],3000]);
_root.改装清单.push([60000,"M4A1战术版","M4A1改装图纸",[["M4A1",1],["M4A1改",1],["战术导轨",5],["高强度合金",5],["强化金属管",5],["枪械内构强化套件",5],["烈性火药",10],["加长弹匣",5],["镭射瞄准具",2]],3000]);
_root.改装清单.push([35000,"WA2000","WA2000改装图纸",[["AWP",1],["上色涂料",10],["可塑式钢板",5],["强化金属管",5],["战术导轨",2],["突击型光学瞄具",2]],0]);
_root.改装清单.push([5000,"双管白火铳","双管白火铳改装图纸",[["双管白火铳制作图纸",1],["白火铳",2],["可塑式钢板",10],["枪械内构强化套件",10],["高强度合金",10],["烈性火药",10],["加长弹匣",2],["突击型光学瞄具",2]],10000]);
_root.改装清单.push([100000,"黄金QBZ","黄金QBZ改装图纸",[["QBZ95",1],["国庆纪念币",10],["上色涂料",5],["高强度合金",10],["枪械内构强化套件",10],["强化金属管",5],["烈性火药",5],["镭射瞄准具",2]],2000]);
_root.改装清单.push([50000,"异形女王毒刺","异形女王毒刺打造图纸",[["异形毒刺",1],["异形龙骨碎片",80],["高强度合金",10]],0]);
_root.改装清单.push([10000,"兽王虎甲盔","兽王虎甲盔打造图纸",[["兽王碎片",30],["蓝晶",10],["方舟秘钥",1],["钢铁小熊头",1]],3000]);
_root.改装清单.push([10000,"兽王虎甲","兽王虎甲打造图纸",[["兽王碎片",30],["蓝晶",10],["方舟秘钥",1],["钢铁小熊上装",1]],3000]);
_root.改装清单.push([10000,"兽王虎甲手套","兽王虎甲手套打造图纸",[["兽王碎片",30],["蓝晶",10],["方舟秘钥",1],["钢铁小熊手套",1]],3000]);
_root.改装清单.push([10000,"兽王虎甲腿甲","兽王虎甲腿甲打造图纸",[["兽王碎片",30],["蓝晶",10],["方舟秘钥",1],["钢铁小熊下装",1]],3000]);
_root.改装清单.push([10000,"兽王虎甲鞋","兽王虎甲鞋打造图纸",[["兽王碎片",30],["蓝晶",10],["方舟秘钥",1],["钢铁小熊鞋",1]],3000]);
_root.改装清单.push([20000,"兽王战甲盔","兽王战甲盔打造图纸",[["兽王虎甲盔",1],["兽王碎片",50],["烈炎矿石",30],["冰魄矿石",10]],4000]);
_root.改装清单.push([20000,"兽王战甲","兽王战甲打造图纸",[["兽王虎甲",1],["兽王碎片",50],["烈炎矿石",30],["冰魄矿石",10]],4000]);
_root.改装清单.push([20000,"兽王战甲手套","兽王战甲手套打造图纸",[["兽王虎甲手套",1],["兽王碎片",50],["烈炎矿石",30],["冰魄矿石",10]],4000]);
_root.改装清单.push([20000,"兽王战甲腿甲","兽王战甲腿甲打造图纸",[["兽王虎甲腿甲",1],["兽王碎片",50],["烈炎矿石",30],["冰魄矿石",10]],4000]);
_root.改装清单.push([20000,"兽王战甲鞋","兽王战甲鞋打造图纸",[["兽王虎甲鞋",1],["兽王碎片",50],["烈炎矿石",30],["冰魄矿石",10]],4000]);
_root.改装清单.push([30000,"异形女王盔","异形女王盔打造图纸",[["异形骨盔",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"异形女王甲","异形女王甲打造图纸",[["异形骨甲",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"异形女王手套","异形女王手套打造图纸",[["异形骨手套",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"异形女王腿甲","异形女王腿甲打造图纸",[["异形骨腿甲",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"异形女王鞋","异形女王鞋打造图纸",[["异形骨鞋",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"试作型原种共生头盔","试作型原种共生头盔打造图纸",[["异形骨盔",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"试作型原种共生上装","试作型原种共生上装打造图纸",[["异形骨甲",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"试作型原种共生手套","试作型原种共生手套打造图纸",[["异形骨手套",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"试作型原种共生下装","试作型原种共生下装打造图纸",[["异形骨腿甲",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([30000,"试作型原种共生鞋","试作型原种共生鞋打造图纸",[["异形骨鞋",1],["异形龙骨碎片",50],["碳纤维布料",10]],0]);
_root.改装清单.push([2020,"诛神头盔","诛神头盔改装图纸",[["精致战术猪鼻式防毒面具",1],["蓝晶面具",1],["钛合金61式头部装甲",1],["炎魔盔",1]],6000]);
_root.改装清单.push([2020,"诛神胸甲","诛神胸甲改装图纸",[["A兵团精致战术背心",1],["蓝晶战斗服",1],["钛合金61式胸甲",1],["炎魔甲",1]],6000]);
_root.改装清单.push([2020,"诛神手套","诛神手套改装图纸",[["A兵团精致战术手套",1],["蓝晶手套",1],["钛合金61式手甲",1],["炎魔手套",1]],6000]);
_root.改装清单.push([2020,"诛神腿甲","诛神腿甲改装图纸",[["A兵团精致战术裤",1],["蓝晶下装",1],["钛合金61式腿甲",1],["炎魔腿甲",1]],6000]);
_root.改装清单.push([2020,"诛神战鞋","诛神战鞋改装图纸",[["A兵团精致战术皮鞋",1],["蓝晶鞋",1],["钛合金61式装甲鞋",1],["炎魔鞋",1]],6000]);
_root.改装清单.push([2020,"诛神枪","诛神枪改装图纸",[["穿刺QBZ95",1],["极品巨兽",1],["M134暴力版",1],["炎魔枪A100",1]],9000]);
_root.改装清单.push([2020,"诛神剑","诛神剑改装图纸",[["烈焰斩马刀",1],["冰魄神斩",1],["血色光剑天秤",1],["炎魔斩new",1]],9000]);
_root.改装清单.push([2020,"诛神项链","强化13的k5项链打造图纸",[["K5项链",13]],1]);
_root.改装清单.push([2020,"诛神短剑","诛神短剑打造图纸",[["光刃摩羯",1],["雷神之锤",1],["秋月",1],["兽王碎片",10]],7999]);
_root.改装清单.push([2020,"诛神短枪","诛神短枪打造图纸",[["极品UZI战术版",1],["钛合金P90",1],["圣诞糖果枪",1],["兽王碎片",10]],7999]);
_root.改装清单.push([2020,"黄金骑士牙狼头盔","黄金骑士头盔改装图纸",[["诛神头盔",1],["远古碎片",60],["强化石",4000]],7999]);
_root.改装清单.push([2020,"黄金骑士牙狼胸甲","黄金骑士胸甲改装图纸",[["诛神胸甲",1],["远古碎片",60],["强化石",4000]],7999]);
_root.改装清单.push([2020,"黄金骑士牙狼手套","黄金骑士手套改装图纸",[["诛神手套",1],["远古碎片",60],["强化石",4000]],7999]);
_root.改装清单.push([2020,"黄金骑士牙狼腿甲","黄金骑士腿甲改装图纸",[["诛神腿甲",1],["远古碎片",60],["强化石",4000]],7999]);
_root.改装清单.push([2020,"黄金骑士牙狼战鞋","黄金骑士战鞋改装图纸",[["诛神战鞋",1],["远古碎片",60],["强化石",4000]],7999]);
_root.改装清单.push([2020,"远古诛神枪","远古诛神枪改装图纸",[["诛神枪",1],["远古碎片",80],["强化石",5000]],9999]);
_root.改装清单.push([2020,"远古诛神剑","远古诛神剑改装图纸",[["诛神剑",1],["黑铁的剑",1],["远古碎片",80],["强化石",5000]],9999]);
_root.改装清单.push([2022,"远古诛神短剑","远古诛神短剑打造图纸",[["诛神短剑",1],["远古碎片",100],["强化石",6000]],8999]);
_root.改装清单.push([2022,"远古诛神短枪","远古诛神短枪打造图纸",[["诛神短枪",1],["极品UZI战术版",1],["远古碎片",100],["强化石",6000]],8999]);
_root.改装清单.push([2020,"远古诛神项链","远古诛神项链打造图纸",[["诛神项链",1],["远古碎片",100],["强化石",5000]],9999]);
_root.改装清单.push([2020,"芬里尔头甲","芬里尔头甲改装图纸",[["远古忍者盔",1],["高强度合金",20],["碳纤维布料",10],["强化石",1000]],7999]);
_root.改装清单.push([2020,"芬里尔胸甲","芬里尔胸甲改装图纸",[["远古忍者甲",1],["高强度合金",20],["碳纤维布料",10],["强化石",1000]],7999]);
_root.改装清单.push([2020,"芬里尔手甲","芬里尔手甲改装图纸",[["远古忍者手套",1],["高强度合金",20],["碳纤维布料",10],["强化石",1000]],7999]);
_root.改装清单.push([2020,"芬里尔腿甲","芬里尔腿甲改装图纸",[["远古忍者腿甲",1],["高强度合金",20],["碳纤维布料",10],["强化石",1000]],7999]);
_root.改装清单.push([2020,"芬里尔鞋","芬里尔鞋改装图纸",[["远古忍者鞋",1],["高强度合金",20],["碳纤维布料",10],["强化石",1000]],7999]);
_root.改装清单.push([5000,"Andy装头","Andy装头改装图纸",[["Andy套装碎片",5]],1499]);
_root.改装清单.push([5000,"Andy上装","Andy上装改装图纸",[["Andy套装碎片",5]],1499]);
_root.改装清单.push([5000,"Andy下装","Andy下装改装图纸",[["Andy套装碎片",5]],1499]);
_root.改装清单.push([5000,"Andy装手套","Andy装手套改装图纸",[["Andy套装碎片",5]],1499]);
_root.改装清单.push([5000,"Andy装鞋","Andy装鞋改装图纸",[["Andy套装碎片",5]],1499]);
_root.改装清单.push([30000,"P90战术版","P90改装图纸",[["P90",1],["战术导轨",5],["上色涂料",5],["小型液晶屏",1],["碳纤维布料",1]],0]);
_root.改装清单.push([20000,"QBZ95","QBZ95制作图纸",[["L85A1",1],["螺丝套件",10],["弹簧",10],["战术导轨",5],["枪械内构强化套件",5]],0]);
_root.改装清单.push([10000,"LS06","LS06制作图纸",[["MP7",1],["螺丝套件",10],["弹簧",10],["战术导轨",2],["动力液压杆",2]],0]);
_root.改装清单.push([50000,"未羊项链","未羊项链打造图纸",[["羊年新年碎片",2015]],0]);
_root.改装清单.push([50000,"申猴项链","申猴项链打造图纸",[["猴年新年碎片",2016]],0]);
_root.改装清单.push([50000,"酉鸡项链","酉鸡项链打造图纸",[["鸡年碎片",2017]],0]);
_root.改装清单.push([50000,"戌狗项链","戌狗项链打造图纸",[["狗年碎片",2018]],0]);
_root.改装清单.push([50000,"亥猪项链","亥猪项链打造图纸",[["猪年碎片",2019]],0]);
_root.改装清单.push([50000,"子鼠项链","子鼠项链打造图纸",[["鼠年碎片",2020]],0]);
_root.改装清单.push([10000,"烈焰斩马刀","烈焰斩马刀改装图纸",[["斩马刀",1],["石英磨刀石",10],["不锈钢材",10],["战术握把",2]],0]);
_root.改装清单.push([50000,"远古忍者盔","远古忍者盔打造图纸",[["方舟武士盔",1],["方舟碎片",50],["蓝晶",10],["烈炎矿石",10],["方舟秘钥",1],["高强度合金",30],["碳纤维布料",30]],0]);
_root.改装清单.push([50000,"远古忍者甲","远古忍者甲打造图纸",[["方舟武士甲",1],["方舟碎片",50],["蓝晶",10],["烈炎矿石",10],["方舟秘钥",1],["高强度合金",30],["碳纤维布料",30]],0]);
_root.改装清单.push([50000,"远古忍者手套","远古忍者手套打造图纸",[["方舟武士手套",1],["方舟碎片",50],["蓝晶",10],["烈炎矿石",10],["方舟秘钥",1],["高强度合金",30],["碳纤维布料",30]],0]);
_root.改装清单.push([50000,"远古忍者腿甲","远古忍者腿甲打造图纸",[["方舟武士腿甲",1],["方舟碎片",50],["蓝晶",10],["烈炎矿石",10],["方舟秘钥",1],["高强度合金",30],["碳纤维布料",30]],0]);
_root.改装清单.push([50000,"远古忍者鞋","远古忍者鞋打造图纸",[["方舟武士鞋",1],["方舟碎片",50],["蓝晶",10],["烈炎矿石",10],["方舟秘钥",1],["高强度合金",30],["碳纤维布料",30]],0]);
_root.改装清单.push([80000,"忍者执剑","忍者执剑打造图纸",[["忍者佩剑",1],["方舟碎片",80],["蓝晶",50],["烈炎矿石",50],["方舟秘钥",2],["石英磨刀石",30],["不锈钢材",30]],0]);
_root.改装清单.push([50000,"战术巴雷特","战术巴雷特打造图纸",[["巴雷特",1],["异形龙骨碎片",80],["突击型光学瞄具",5]],0]);
_root.改装清单.push([10000,"炎魔盔","炎魔盔改装图纸",[["合金盔",1],["碳纤维布料",2],["烈炎矿石",50]],0]);
_root.改装清单.push([10000,"炎魔甲","炎魔甲改装图纸",[["合金甲",1],["碳纤维布料",2],["烈炎矿石",50]],0]);
_root.改装清单.push([10000,"炎魔手套","炎魔手套改装图纸",[["合金手套",1],["碳纤维布料",2],["烈炎矿石",50]],0]);
_root.改装清单.push([10000,"炎魔腿甲","炎魔腿甲改装图纸",[["合金腿甲",1],["碳纤维布料",2],["烈炎矿石",50]],0]);
_root.改装清单.push([10000,"炎魔鞋","炎魔鞋改装图纸",[["合金鞋",1],["碳纤维布料",2],["烈炎矿石",50]],0]);
_root.改装清单.push([10000,"炎魔枪A100","炎魔枪A100改装图纸",[["烈焰枪A100",1],["镭射瞄准具",2],["烈炎矿石",80]],0]);
_root.改装清单.push([10000,"炎魔枪B100","炎魔枪B100改装图纸",[["烈焰枪B100",1],["突击型光学瞄具",2],["烈炎矿石",80]],0]);
_root.改装清单.push([10000,"炎魔斩new","炎魔斩",[["烈焰斩",1],["战术握把",2],["烈炎矿石",80]],0]);
_root.改装清单.push([5000,"冰魄神斩","冰魄神斩改装图纸",[["冰魄斩",1],["冰魄矿石",10],["高级木料",20]],0]);
_root.改装清单.push([5000,"极品巨兽","极品巨兽改装图纸",[["巨兽",1],["强化金属管",20],["高强度合金",20]],0]);
_root.改装清单.push([5000,"蓝晶面具","蓝晶面具改装图纸",[["次品蓝晶面具",1],["蓝晶",5],["高强度合金",10]],0]);
_root.改装清单.push([5000,"蓝晶战斗服","蓝晶战斗服改装图纸",[["次品蓝晶战斗服",1],["蓝晶",5],["高强度合金",10]],0]);
_root.改装清单.push([5000,"蓝晶手套","蓝晶手套改装图纸",[["次品蓝晶手套",1],["蓝晶",5],["高强度合金",10]],0]);
_root.改装清单.push([5000,"蓝晶下装","蓝晶下装改装图纸",[["次品蓝晶下装",1],["蓝晶",5],["高强度合金",10]],0]);
_root.改装清单.push([5000,"蓝晶鞋","蓝晶鞋改装图纸",[["次品蓝晶鞋",1],["蓝晶",5],["高强度合金",10]],0]);


_root.改装清单对象 = {};
for(var i = 0; i < _root.改装清单.length; i++){
	_root.改装清单对象[_root.改装清单[i][1]] = {
		K点价格:_root.改装清单[i][0],
		名称:_root.改装清单[i][1],
		图纸名称:_root.改装清单[i][2],
		材料:_root.改装清单[i][3]
	}
}

for(var i = 0; i < _root.属性武器改装清单.length; i++){
	_root.改装清单对象[_root.属性武器改装清单[i][1]] = {
		K点价格:_root.属性武器改装清单[i][0],
		名称:_root.属性武器改装清单[i][1],
		图纸名称:_root.属性武器改装清单[i][2],
		材料:_root.属性武器改装清单[i][3]
	}
}

_root.当前改装清单 = _root.改装清单;
*/