_root.战宠进阶函数 = new Object();

var 无条件 = function(){
	return true;
}

_root.战宠进阶函数.凑数组的 = {
	初始化:null,
	描述:"",
	消耗金币:0,
	消耗K点:0,
	消耗道具:[],
	次数条件:0,
	次数上限:0,
	解锁等级:0,
	次数上限:false,
	条件:function(){
		return false;
	},
	执行:null,
	单位进阶执行:null
}

_root.战宠进阶函数.基础训练 = {
	初始化:null,
	消耗金币:25000,
	消耗K点:0,
	消耗道具:[],
	次数条件:0,
	次数上限:1,
	解锁等级:10,
	称号:["【精锐Ⅰ】","【精锐Ⅱ】","【精锐Ⅲ】"],
	罗马数字:["Ⅰ","Ⅱ","Ⅲ"],
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			return "十级以上可以进行基础训练，提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			return "已完成基础训练。基础训练可获得的属性提升达到上限"
		}
		return "点击可进行训练，需要消耗"+ this.进阶方案.基础训练.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进行训练",
	背景:"训练",
	排列宠物图标:true,
	详情页描述:function(){
		var 基础介绍 = "对于基础体质较弱的单位可以进行一轮深度的基础训练，通过体能锻炼、功能性训练、健康理疗等途径提升身体强度，提高一定生命值、防御力和攻击力。"
		if(this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			return 基础介绍 + "<br>十级以上可以进行基础训练。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			return 基础介绍 + "<br>当前已完成基础训练，基础训练可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>进行基础训练需要消耗"+ this.进阶方案.基础训练.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.基础训练.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成基础训练！");
		_root.金钱 -= this.进阶方案.基础训练.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:1,
				基础训练:true,
				启用:true
			}
		}else if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数<1){
			this.当前宠物属性.基础训练.次数 = 1;
			this.当前宠物属性.基础训练.基础训练 = true;
		}
		// _root.宠物信息界面.排列宠物图标();
		刷新当前宠物();
	},
	单位进阶执行:function(){
		if(this.宠物属性.基础训练 && this.宠物属性.基础训练.启用){
			if(this.宠物属性.基础训练.次数 == 1 || this.宠物属性.基础训练.基础训练){
				this.hp满血值 += 2000 * _root.难度等级;
				this.hp += 2000 * _root.难度等级;
				this.防御力 += 100;
				this.空手攻击力 += 30 * _root.难度等级;
				this.韧性系数 += 5;
				if(!this.已有称号){
					this.称号 =  _root.战宠进阶函数.基础训练.称号[this.宠物属性.基础训练.次数-1];
				}
			}
			if(this.宠物属性.基础训练.次数 == 2 || this.宠物属性.基础训练.强化药剂){
				this.hp满血值 += 3500 * _root.难度等级;
				this.hp += 3500 * _root.难度等级;
				this.防御力 += 100;
				this.空手攻击力 += 100 * _root.难度等级;
				this.韧性系数 += 10;
				if(!this.已有称号){
					this.称号 =  _root.战宠进阶函数.基础训练.称号[this.宠物属性.基础训练.次数-1];
				}
			}
			if(this.宠物属性.基础训练.次数 == 3 || this.宠物属性.基础训练.超级血清){
				this.hp满血值 += 10000 * _root.难度等级;
				this.hp += 10000 * _root.难度等级;
				this.防御力 += 50;
				this.空手攻击力 += 150 * _root.难度等级;
				this.韧性系数 += 20;
				if(!this.已有称号){
					this.称号 =  _root.战宠进阶函数.基础训练.称号[this.宠物属性.基础训练.次数-1];
				}
			}
		}
	}
}

_root.战宠进阶函数.强化药剂 = {
	初始化:null,
	消耗金币:50000,
	消耗K点:0,
	消耗道具:[],
	次数条件:1,
	次数上限:2,
	解锁等级:25,
	描述:function(){
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return "基础体质不足以承受强化药剂，请先进行训练";
		}
		if(this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			return "二十五级以上可以注射强化药剂，提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			return "已注射强化药剂。强化药剂可获得的属性提升达到上限"
		}
		return "对于身体素质中等水平的单位可以注射强化药剂并进行适应性训练，进一步提高生命值、防御力和攻击力。点击可进行强化药剂注射与适应性训练，需要消耗"+ this.进阶方案.强化药剂.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"注射药剂",
	背景:"生化",
	排列宠物图标:true,
	详情页描述:function(){
		var 基础介绍 = "得益于统合政府主导下科研机构的广泛研究，及其积累的实验数据，我们得以在百废待兴的末世中回收利用先进的人体改造技术。<br>不同于传统意义上的义体改造或者基因改造，我们所利用的技术的原理是：利用投放物质的生化反应改造人体的生理活动，以充分激发人体潜能。因动物之间的生理活动相似性，该改造依然可以运用于其他种类的生物。该方案副作用小，技术可靠。";
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return 基础介绍 + "<br>当前体质不足以承受强化药剂，请先进行训练。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			return 基础介绍 + "<br>二十五级以上可以注射强化药剂，中等幅度提升攻击力、防御力和生命值。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			return 基础介绍 + "<br>当前已注射强化药剂，强化药剂可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>注射强化药剂与适应性训练共需要消耗"+ this.进阶方案.强化药剂.消耗金币+"金币，中等幅度提升攻击力、防御力和生命值。";
	},
	条件:function(){
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return false;
		}else if( this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.强化药剂.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成强化药剂注射与适应性训练！");
		_root.金钱 -= this.进阶方案.强化药剂.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:2,
				强化药剂:true,
				启用:true
			}
		}else{
			if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数<2){
				this.当前宠物属性.基础训练.次数 = 2;
			}
			this.当前宠物属性.基础训练.强化药剂 = true;
		} 
		// _root.宠物信息界面.排列宠物图标();
		刷新当前宠物();
	},
	单位进阶执行:_root.战宠进阶函数.基础训练.单位进阶执行
}

_root.战宠进阶函数.超级血清 = {
	初始化:null,
	消耗金币:100000,
	消耗K点:0,
	消耗道具:[],
	次数条件:2,
	次数上限:3,
	解锁等级:50,
	描述:function(){
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件)){
			return "当前体质不足以承受超级血清，请先进行强化";
		}
		if(this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			return "五十级以上可以注射超级血清，进一步提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			return "已注射超级血清。超级血清可获得的属性提升达到上限"
		}
		return "对于身体素质较强的单位可以注射超级血清并进行适应性训练，显著提高生命值并增加一定防御力和攻击力。点击可进行超级血清注射与适应性训练，需要消耗"+ this.进阶方案.超级血清.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"注射血清",
	背景:"生化",
	排列宠物图标:true,
	详情页描述:function(){
		var 基础介绍 = "近期的实验表明，如果要通过生化反应这种方式制造超级战士，循序渐进的培养方案是最稳妥的。我们不能寄希望于速成，因为人体（以及其他动物的身体）必须适应药物带来的变化，这需要时间。此外，药物试验需要与之匹配的工业产能，这必然需要资金投入。从客户手中获取改造资金已是必然选择，该领域的商业化推广已是箭在弦上。";
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件)){
			return 基础介绍 + "<br>当前体质不足以承受超级血清，请先进行强化。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			return 基础介绍 + "<br>五十级以上可以注射超级血清，进一步提升攻击力、防御力并大幅提升生命值。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			return 基础介绍 + "<br>当前已注射超级血清，超级血清可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>注射超级血清与适应性训练共需要消耗"+ this.进阶方案.超级血清.消耗金币+"金币，可提升攻击力、防御力并大幅提升生命值。";
	},
	条件:function(){
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件 )){
			return false;
		}else if( this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.超级血清.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成超级血清注射与适应性训练！");
		_root.金钱 -= this.进阶方案.超级血清.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:3,
				超级血清:true,
				启用:true
			}
		}else{
			if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数上限){
				this.当前宠物属性.基础训练.次数 = this.进阶方案.超级血清.次数上限;
			}
			this.当前宠物属性.基础训练.超级血清 = true;
		} 
		//_root.宠物信息界面["宠物信息显示框"+this.宠物信息数组号].宠物名 = "";
		// _root.宠物信息界面.排列宠物图标();
	},
	单位进阶执行:_root.战宠进阶函数.基础训练.单位进阶执行
}


_root.战宠进阶函数.弹射弧光斩 = {
	初始化:null,
	消耗金币:200000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【弧光】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.弹射弧光斩.解锁等级){
			return this.进阶方案.弹射弧光斩.解锁等级 + "级以上可以升级武器，解锁招式弹射弧光斩"
		}
		if(this.当前宠物属性.弹射弧光斩){
			return "武器升级已完成"
		}
		return "点击可升级武器，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.弹射弧光斩.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"升级武器",
	背景:"装备",
	详情页描述:function(){
		var 基础介绍 = "对键盘的武器进行强化升级，提高攻击力，并解锁招式弹射弧光斩。"
		if(this.当前宠物信息[1] < this.进阶方案.弹射弧光斩.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.弹射弧光斩.解锁等级+"级以上可以升级武器。"
		}
		if(this.当前宠物属性.弹射弧光斩 ){
			return 基础介绍 + "<br>当前已完成武器升级。"
		}
		return 基础介绍 + "<br>武器升级需要消耗"+ this.进阶方案.弹射弧光斩.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.弹射弧光斩.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.弹射弧光斩.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.弹射弧光斩){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成武器升级！");
		_root.金钱 -= this.进阶方案.弹射弧光斩.消耗金币;
		this.当前宠物属性.弹射弧光斩 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.弹射弧光斩){
			this.空手攻击力 += 150 * _root.难度等级;
			this.称号 =  _root.战宠进阶函数.弹射弧光斩.称号;
		}
	}
}

_root.战宠进阶函数.广域裂空斩 = {
	初始化:null,
	消耗金币:200000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【裂空】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.广域裂空斩.解锁等级){
			return this.进阶方案.广域裂空斩.解锁等级 + "级以上可以升级武器，解锁招式广域裂空斩"
		}
		if(this.当前宠物属性.广域裂空斩){
			return "武器升级已完成"
		}
		return "点击可升级武器，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.广域裂空斩.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"升级武器",
	背景:"装备",
	详情页描述:function(){
		var 基础介绍 = "对主唱的武器进行强化升级，提高攻击力，并解锁招式广域裂空斩。"
		if(this.当前宠物信息[1] < this.进阶方案.广域裂空斩.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.广域裂空斩.解锁等级+"级以上可以升级武器。"
		}
		if(this.当前宠物属性.广域裂空斩){
			return 基础介绍 + "<br>当前已完成武器升级。"
		}
		return 基础介绍 + "<br>武器升级需要消耗"+ this.进阶方案.广域裂空斩.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.广域裂空斩.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.广域裂空斩.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.广域裂空斩){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成武器升级！");
		_root.金钱 -= this.进阶方案.广域裂空斩.消耗金币;
		this.当前宠物属性.广域裂空斩 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.广域裂空斩){
			this.空手攻击力 += 150 * _root.难度等级;
			this.近战技能库.push("广域裂空斩");
			//this.远程技能库.push("广域裂空斩");
			this.超远程技能库.push("拔刀裂空斩");
			this.身后技能库.push("广域裂空斩");
			this.横向技能库.push("横向裂空斩");
			this.称号 =  _root.战宠进阶函数.广域裂空斩.称号;
		}
	}
}
_root.战宠进阶函数.导弹烈炎炮 = {
	初始化:null,
	消耗金币:200000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【烈炎】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.导弹烈炎炮.解锁等级){
			return this.进阶方案.导弹烈炎炮.解锁等级 + "级以上可以升级武器，解锁招式导弹烈炎炮"
		}
		if(this.当前宠物属性.导弹烈炎炮){
			return "武器升级已完成"
		}
		return "点击可升级武器，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.导弹烈炎炮.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"升级武器",
	背景:"装备",
	详情页描述:function(){
		var 基础介绍 = "对吉他的武器进行强化升级，提高攻击力，并解锁招式导弹烈炎炮。"
		if(this.当前宠物信息[1] < this.进阶方案.导弹烈炎炮.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.导弹烈炎炮.解锁等级+"级以上可以升级武器。"
		}
		if(this.当前宠物属性.导弹烈炎炮 ){
			return 基础介绍 + "<br>当前已完成武器升级。"
		}
		return 基础介绍 + "<br>武器升级需要消耗"+ this.进阶方案.导弹烈炎炮.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.导弹烈炎炮.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.导弹烈炎炮.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.导弹烈炎炮){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成武器升级！");
		_root.金钱 -= this.进阶方案.导弹烈炎炮.消耗金币;
		this.当前宠物属性.导弹烈炎炮 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.导弹烈炎炮){
			this.空手攻击力 += 150 * _root.难度等级;
			if(this.y轴攻击范围 < 25){
				this.y轴攻击范围 = 25;
			}
			this.近战技能库.push("导弹烈炎炮");
			this.中程技能库.push("导弹烈炎炮");
			this.远程技能库.push("导弹炮");
			this.超远程技能库.push("烈炎炮");
			this.横向技能库.push("广域喷火");
			this.称号 =  _root.战宠进阶函数.导弹烈炎炮.称号;
		}
	}
}

_root.战宠进阶函数.切换发型 = {
	初始化:function(){
		if(!this.当前宠物属性.发色){
			this.当前宠物属性.发色 = "橙";
		}
	},
	描述:function(){
		return "染发：当前为"+this.当前宠物属性.发色+"发";
	},
	消耗金币:0,
	消耗K点:0,
	消耗道具:[],
	背景:"外观",
	条件:function(){
		return true;
	},
	执行:function(){
		if(this.当前宠物属性.发色=="橙"){
			this.当前宠物属性.发色="白";
		}else if(this.当前宠物属性.发色=="白"){
			this.当前宠物属性.发色="橙";
		}else{
			this.当前宠物属性.发色="白";
		}
		//this.JK.gotoAndStop(this.当前宠物属性.发色);
		_root.宠物信息界面["宠物信息显示框"+this.宠物信息数组号].宠物头像.JK.gotoAndStop(this.当前宠物属性.发色);
		// 查找战宠是否在场
		for(i=0; i<_root.宠物mc库.length; i++){
			if(_root.宠物mc库[i].宠物属性.宠物信息数组号 == this.宠物信息数组号){
				_root.宠物mc库[i].发色 = this.当前宠物属性.发色;
				break;
			}
		}
	}
}

_root.战宠进阶函数.常驻淬毒 = {
	初始化:null,
	消耗金币:500,
	消耗K点:0,
	效果:80,
	消耗道具:[],
	解锁等级:1,
	描述:function(){
		if(this.当前宠物属性.常驻淬毒 && this.当前宠物属性.常驻淬毒.启用 ){
			return "点击可关闭常驻淬毒，不再消耗金币"
		}
		return "点击可开启常驻淬毒，每张图将消耗"+ this.进阶方案.常驻淬毒.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"开启/关闭",
	背景:"装备",
	详情页描述:function(){
		var 基础介绍 = "A兵团提供的毒药也可以向一同作战的友方共享。<br>部分单位可以淬毒，每张图自动消耗"+ this.进阶方案.常驻淬毒.消耗金币+"金币，获得"+ this.进阶方案.常驻淬毒.效果+"点剧毒性，仅战斗地图有效。金币不足时将不会生效。"
		if(this.当前宠物属性.常驻淬毒 && this.当前宠物属性.常驻淬毒.启用){
			return 基础介绍 + "<br>当前已开启常驻淬毒。"
		}
		return 基础介绍 + "<br>当前未开启常驻淬毒。";
	},
	条件:function(){
		return true;
	},
	执行:function(){
		if(!this.当前宠物属性.常驻淬毒){
			this.当前宠物属性.常驻淬毒 = {
				来源:"玩家",
				启用:true
			}
		}else if(this.当前宠物属性.常驻淬毒.启用){
			this.当前宠物属性.常驻淬毒 = {
				来源:"玩家",
				启用:false
			}
		}else{
			this.当前宠物属性.常驻淬毒 = {
				来源:"玩家",
				启用:true
			}
		}
	},
	单位进阶执行:function(){
		if(!this.已常驻淬毒 && _root.当前为战斗地图 && this.宠物属性.常驻淬毒 && this.宠物属性.常驻淬毒.启用){
			if(this.宠物属性.常驻淬毒.来源 == "玩家"){
				if(_root.金钱 >= _root.战宠进阶函数.常驻淬毒.消耗金币){
					_root.金钱 -= _root.战宠进阶函数.常驻淬毒.消耗金币;
					_root.发布消息("战宠"+this.名字+"消耗金币"+_root.战宠进阶函数.常驻淬毒.消耗金币+"淬毒");
					if(this.淬毒){
						this.淬毒 += _root.战宠进阶函数.常驻淬毒.效果;
					}else{
						this.淬毒 = _root.战宠进阶函数.常驻淬毒.效果;
					}
					this.已常驻淬毒 = true;
				}
			}else{
				if(this.淬毒){
					this.淬毒 += _root.战宠进阶函数.常驻淬毒.效果;
				}else{
					this.淬毒 = _root.战宠进阶函数.常驻淬毒.效果;
				}
				this.已常驻淬毒 = true;
			}
		}
	}
}


_root.战宠进阶函数.冲腿龙息 = {
	名称:"冲腿：龙息",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【龙息】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.冲腿龙息.解锁等级){
			return this.进阶方案.冲腿龙息.解锁等级 + "级以上可以领悟招式，解锁"+this.进阶方案.冲腿龙息.名称
		}
		if(this.当前宠物属性.冲腿龙息){
			return "已领悟招式"
		}
		return "点击可领悟招式，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.冲腿龙息.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"领悟招式",
	背景:"武术",
	详情页描述:function(){
		var 基础介绍 = "在长时间的修炼之中融会贯通，重新领会咏春武学的技巧，并融入lee自身的迅猛招式之中。<br>提升攻击力，并解锁招式"+this.进阶方案.冲腿龙息.名称+"，可以御气越过敌方防御，打出冲属性伤害。"
		if(this.当前宠物信息[1] < this.进阶方案.冲腿龙息.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.冲腿龙息.解锁等级+"级以上可以领悟招式。"
		}
		if(this.当前宠物属性.冲腿龙息){
			return 基础介绍 + "<br>当前已领悟该招式。"
		}
		return 基础介绍 + "<br>领悟招式需要消耗"+ this.进阶方案.冲腿龙息.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.冲腿龙息.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.冲腿龙息.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.冲腿龙息){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已领悟招式！");
		_root.金钱 -= this.进阶方案.冲腿龙息.消耗金币;
		this.当前宠物属性.冲腿龙息 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.冲腿龙息){
			this.空手攻击力 += 150 * _root.难度等级;
			this.称号 =  _root.战宠进阶函数.冲腿龙息.称号;
		}
	}
}
_root.战宠进阶函数.晶能者 = {
	名称:"结晶砾雨&晶线光",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【晶能者】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.晶能者.解锁等级){
			return this.进阶方案.晶能者.解锁等级 + "级以上可以领悟招式，解锁"+this.进阶方案.晶能者.名称
		}
		if(this.当前宠物属性.晶能者){
			return "已领悟招式"
		}
		return "点击可领悟招式，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.晶能者.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"领悟招式",
	背景:"超能",
	详情页描述:function(){
		var 基础介绍 = "掌握更强大的力量。<br>例如将水晶聚成暴雨、陨石、山，或是其他什么，例如操纵光。<br>提升攻击力、防御力，并解锁招式"+this.进阶方案.晶能者.名称+"，可以造成大范围伤害，以及能量属性伤害。"
		if(this.当前宠物信息[1] < this.进阶方案.晶能者.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.晶能者.解锁等级+"级以上可以领悟招式。"
		}
		if(this.当前宠物属性.晶能者){
			return 基础介绍 + "<br>当前已领悟该招式。"
		}
		return 基础介绍 + "<br>领悟招式需要消耗"+ this.进阶方案.晶能者.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.晶能者.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.晶能者.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.晶能者){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已领悟招式！");
		_root.金钱 -= this.进阶方案.晶能者.消耗金币;
		this.当前宠物属性.晶能者 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.晶能者){
			this.空手攻击力 += 10 * _root.难度等级;
			this.防御力 += 50;
			this.称号 =  _root.战宠进阶函数.晶能者.称号;
		}
	}
}

_root.战宠进阶函数.复仇者 = {
	名称:"双向射击&复仇者",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【复仇者】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.复仇者.解锁等级){
			return this.进阶方案.复仇者.解锁等级 + "级以上可以领悟招式，解锁"+this.进阶方案.复仇者.名称
		}
		if(this.当前宠物属性.复仇者){
			return "已领悟招式"
		}
		return "点击可领悟招式，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.复仇者.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"领悟招式",
	背景:"超能",
	详情页描述:function(){
		var 基础介绍 = "浮士德兄弟将拥有更亲密无间的配合，也将变得更加危险。<br>提升攻击力、防御力，并解锁招式"+this.进阶方案.复仇者.名称+"。可以向左右两侧方向进行弹幕射击，白无常触发复仇的概率大幅提升。"
		if(this.当前宠物信息[1] < this.进阶方案.复仇者.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.复仇者.解锁等级+"级以上可以领悟招式。"
		}
		if(this.当前宠物属性.复仇者){
			return 基础介绍 + "<br>当前已领悟该招式。"
		}
		return 基础介绍 + "<br>领悟招式需要消耗"+ this.进阶方案.复仇者.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.复仇者.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.复仇者.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.复仇者){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已领悟招式！");
		_root.金钱 -= this.进阶方案.复仇者.消耗金币;
		this.当前宠物属性.复仇者 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.复仇者){
			this.空手攻击力 += 30 * _root.难度等级;
			this.防御力 += 100;
			this.称号 =  _root.战宠进阶函数.复仇者.称号;
		}
	}
}

_root.战宠进阶函数.涅槃重生 = {
	名称:"涅槃重生",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【不死鸟】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.涅槃重生.解锁等级){
			return this.进阶方案.涅槃重生.解锁等级 + "级以上可以进阶，提高攻击，获得涅槃之力"
		}
		if(this.当前宠物属性.涅槃重生){
			return "已进阶"
		}
		return "点击可进阶，提高攻击，并获得涅槃之力，需要消耗"+ this.进阶方案.涅槃重生.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进阶能力",
	背景:"超能",
	详情页描述:function(){
		var 基础介绍 = "于火中升华，完全掌握烈焰与重生之力。<br>提升攻击力，融合一二阶段并各取所长，可以立刻造成热属性伤害并持续回复生命，且不再会被击倒。"
		if(this.当前宠物信息[1] < this.进阶方案.涅槃重生.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.涅槃重生.解锁等级+"级以上可以进阶。"
		}
		if(this.当前宠物属性.涅槃重生){
			return 基础介绍 + "<br>当前已进阶。"
		}
		return 基础介绍 + "<br>进阶需要消耗"+ this.进阶方案.涅槃重生.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.涅槃重生.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.涅槃重生.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.涅槃重生){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已进阶！");
		_root.金钱 -= this.进阶方案.涅槃重生.消耗金币;
		this.当前宠物属性.涅槃重生 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.涅槃重生){
			this.空手攻击力 += 10 * _root.难度等级;
			this.hp满血值 *= 2;
			this.称号 =  _root.战宠进阶函数.涅槃重生.称号;
			this.已有称号 =  true;
		}
	}
}

_root.战宠进阶函数.影子刺客 = {
	名称:"影子刺客",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【夜行者】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.影子刺客.解锁等级){
			return this.进阶方案.影子刺客.解锁等级 + "级以上可以进阶，提高攻击，获得暗影之力"
		}
		if(this.当前宠物属性.影子刺客){
			return "已进阶，再次点击进阶按钮可启用或停用影子形象（不影响战斗能力）"
		}
		return "点击可进阶，提高攻击，并获得暗影之力，需要消耗"+ this.进阶方案.影子刺客.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进阶能力",
	背景:"超能",
	详情页描述:function(){
		var 基础介绍 = "将身形隐匿于暗影。<br>获得高额的高危闪避，攻击附着剧毒性，不再会被击倒。"
		if(this.当前宠物信息[1] < this.进阶方案.影子刺客.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.影子刺客.解锁等级+"级以上可以进阶。"
		}
		if(this.当前宠物属性.影子刺客){
			return 基础介绍 + "<br>当前已进阶，再次点击进阶按钮可启用或停用影子形象（不影响战斗能力）。"
		}
		return 基础介绍 + "<br>进阶需要消耗"+ this.进阶方案.影子刺客.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.影子刺客.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.影子刺客.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}
		return true;
	},
	执行:function(){
		if(!this.当前宠物属性.影子刺客){
			_root.最上层发布文字提示("已进阶！");
			_root.金钱 -= this.进阶方案.影子刺客.消耗金币;
			this.当前宠物属性.影子刺客 = true;
			this.当前宠物属性.影子单位 = true;
		}else{
			this.当前宠物属性.影子单位 = !this.当前宠物属性.影子单位;
			_root.最上层发布文字提示("影子状态已" + (this.当前宠物属性.影子单位?"启用":"停用"));
			_root.敌人函数.应用影子色彩(this);
		}
	},
	单位进阶执行:function(){
		if(this.宠物属性.影子刺客){
			this.空手攻击力 += 20 * _root.难度等级;
			this.懒闪避 = 0.95;
			this.毒 = 100;
			if(this.躲闪率>3){
				this.躲闪率 -= 2;
			}
			this.称号 =  _root.战宠进阶函数.影子刺客.称号;
			this.已有称号 =  true;
		}
		if(this.宠物属性.影子单位){
			this.影子单位 = true;
		}
	}
}
_root.战宠进阶函数.追踪飞弹 = {
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【掠夺者】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.追踪飞弹.解锁等级){
			return this.进阶方案.追踪飞弹.解锁等级 + "级以上可以升级飞弹，获得追踪效果，并有概率产生能量伤害"
		}
		if(this.当前宠物属性.追踪飞弹){
			return "飞弹升级已完成"
		}
		return "点击可升级飞弹，获得追踪效果，并有概率产生能量伤害，需要消耗"+ this.进阶方案.追踪飞弹.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"升级飞弹",
	背景:"装备",
	详情页描述:function(){
		var 基础介绍 = "对铁血战士进行升级，提高攻击力、生命值与能量抗性，并解锁飞弹的追踪效果和概率触发的能量伤害。"
		if(this.当前宠物信息[1] < this.进阶方案.追踪飞弹.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.追踪飞弹.解锁等级+"级以上可以升级飞弹。"
		}
		if(this.当前宠物属性.追踪飞弹){
			return 基础介绍 + "<br>当前已完成飞弹升级。"
		}
		return 基础介绍 + "<br>飞弹升级需要消耗"+ this.进阶方案.追踪飞弹.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.追踪飞弹.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.追踪飞弹.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.追踪飞弹){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成飞弹升级！");
		_root.金钱 -= this.进阶方案.追踪飞弹.消耗金币;
		this.当前宠物属性.追踪飞弹 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.追踪飞弹){
			this.空手攻击力 += 80 * _root.难度等级;
			this.hp += 5000 * _root.难度等级;
			this.hp满血值 += 5000 * _root.难度等级;
			// this.魔法抗性 = {基础:30 + this.等级 * 0.6};
			this.提升属性抗性 = _root.敌人函数.提升属性抗性;
			this.提升属性抗性(30 + this.等级 * 0.6);
			this.称号 =  _root.战宠进阶函数.追踪飞弹.称号;
			this.已有称号 =  true;
		}
	}
}
_root.战宠进阶函数.驯鹰者 = {
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【驯鹰者】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.驯鹰者.解锁等级){
			return this.进阶方案.驯鹰者.解锁等级 + "级以上可以进阶，可以携带铁血鹰作战"
		}
		if(this.当前宠物属性.驯鹰者){
			return "进阶已完成"
		}
		return "点击可进阶，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.驯鹰者.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进阶",
	背景:"进化",
	详情页描述:function(){
		var 基础介绍 = "对铁血战士进行升级，提高攻击力、生命值与能量抗性，并可以携带铁血鹰作战。"
		if(this.当前宠物信息[1] < this.进阶方案.驯鹰者.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.驯鹰者.解锁等级+"级以上可以进阶。"
		}
		if(this.当前宠物属性.驯鹰者){
			return 基础介绍 + "<br>当前已完成进阶。"
		}
		return 基础介绍 + "<br>进阶需要消耗"+ this.进阶方案.驯鹰者.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.驯鹰者.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.驯鹰者.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.驯鹰者){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成进阶！");
		_root.金钱 -= this.进阶方案.驯鹰者.消耗金币;
		this.当前宠物属性.驯鹰者 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.驯鹰者){
			this.空手攻击力 += 80 * _root.难度等级;
			this.hp += 5000 * _root.难度等级;
			this.hp满血值 += 5000 * _root.难度等级;
			// this.魔法抗性 = {基础:30 + this.等级 * 0.6};
			this.提升属性抗性 = _root.敌人函数.提升属性抗性;
			this.提升属性抗性(30 + this.等级 * 0.6);
			this.称号 =  _root.战宠进阶函数.驯鹰者.称号;
			this.已有称号 =  true;
		}
	}
}
_root.战宠进阶函数.美洲狮 = {
	初始化:null,
	消耗金币:50000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:60,
	称号:"",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.美洲狮.解锁等级){
			return this.进阶方案.美洲狮.解锁等级 + "级以上可以进化为美洲狮异形，大幅增强面板并获得热属性伤害"
		}
		if(this.当前宠物属性.美洲狮){
			return "进化已完成"
		}
		if(this.当前宠物信息[0] == 103){
			return "当前已是美洲狮异形"
		}
		return "点击可进化为美洲狮异形，大幅增强面板并获得热属性伤害，需要消耗"+ this.进阶方案.美洲狮.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进化",
	背景:"进化",
	排列宠物图标:true,
	详情页描述:function(){
		var 基础介绍 = "将该异形进化为美洲狮异形，大幅提高所有属性，并可以掌握热属性伤害。"
		if(this.当前宠物信息[1] < this.进阶方案.美洲狮.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.美洲狮.解锁等级+"级以上可以进化。"
		}
		if(this.当前宠物属性.美洲狮 ){
			return 基础介绍 + "<br>当前已完成进化。"
		}
		return 基础介绍 + "<br>进化需要消耗"+ this.进阶方案.美洲狮.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.美洲狮.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.美洲狮.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.美洲狮 || this.当前宠物信息[0] == 103){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成进化！");
		_root.金钱 -= this.进阶方案.美洲狮.消耗金币;
		this.当前宠物信息[0] = 103;
		this.当前宠物属性.美洲狮 = true;
		// _root.宠物信息界面.排列宠物图标();
	},
	单位进阶执行:function(){
		if(this.宠物属性.美洲狮){
			// this.称号 =  _root.战宠进阶函数.美洲狮.称号;
		}
	}
}
_root.战宠进阶函数.追猎 = {
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【追猎】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.追猎.解锁等级){
			return this.进阶方案.追猎.解锁等级 + "级以上可以进阶，可以实现更强大的追踪攻击"
		}
		if(this.当前宠物属性.追猎){
			return "进阶已完成"
		}
		return "点击可进阶，提高攻击并解锁新招式，需要消耗"+ this.进阶方案.追猎.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进阶",
	背景:"武术",
	详情页描述:function(){
		var 基础介绍 = "对当前单位进行升级，提高攻击力、防御力、生命值，并可以掌握更强大的追踪攻击。"
		if(this.当前宠物信息[1] < this.进阶方案.追猎.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.追猎.解锁等级+"级以上可以进阶。"
		}
		if(this.当前宠物属性.追猎){
			return 基础介绍 + "<br>当前已完成进阶。"
		}
		return 基础介绍 + "<br>进阶需要消耗"+ this.进阶方案.追猎.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.追猎.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.追猎.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.追猎){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成进阶！");
		_root.金钱 -= this.进阶方案.追猎.消耗金币;
		this.当前宠物属性.追猎 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.追猎){
			this.空手攻击力 += 80 * _root.难度等级;
			this.hp += 5000 * _root.难度等级;
			this.hp满血值 += 5000 * _root.难度等级;
			this.防御力 += 150;
			this.称号 =  _root.战宠进阶函数.追猎.称号;
			this.已有称号 =  true;
			if(this.横向技能库){
				this.横向技能库.push("追踪攻击");
			}
			if(this.范围外技能库){
				this.范围外技能库.push("追踪攻击");
			}
		}
	}
}


_root.战宠进阶函数.战马血清 = {
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:35,
	称号:"【铁骑将军】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.战马血清.解锁等级){
			return "35级以上可以为战马注射超级血清，进一步提升属性"
		}
		if(this.当前宠物属性.战马血清){
			return "已为战马注射超级血清。超级血清可获得的属性提升达到上限"
		}
		return "黑龙的战马也可以注射超级血清，显著提高生命值并增加一定防御力和攻击力。点击可进行超级血清注射与适应性训练，需要消耗"+ this.进阶方案.战马血清.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"注射血清",
	背景:"生化",
	详情页描述:function(){
		var 基础介绍 = "黑龙自身强大的身体素质已经无法通过药物来更进一步，但是他的战马可以。<br>尽管他过去曾拒绝过这一提议，但在生物强化技术已经广泛验证了功效的现在，只要你愿意选用最先进、最安全且最昂贵的方案，黑龙是愿意让步的。";
		if(this.当前宠物信息[1] < this.进阶方案.战马血清.解锁等级){
			return 基础介绍 + "<br>35级以上可以为黑龙的战马注射超级血清，提升骑马状态下的攻击力、防御力并大幅提升生命值。"
		}
		if(this.当前宠物属性.战马血清){
			return 基础介绍 + "<br>黑龙的战马当前已注射超级血清，可获得的骑马状态下属性提升达到上限。"
		}
		return 基础介绍 + "<br>为黑龙的战马注射超级血清与适应性训练共需要消耗需要消耗"+ this.进阶方案.战马血清.消耗金币+"金币，将提升骑马状态下的攻击力、防御力并大幅提升生命值。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.战马血清.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.战马血清.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.战马血清){
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成进阶！");
		_root.金钱 -= this.进阶方案.战马血清.消耗金币;
		this.当前宠物属性.战马血清 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.战马血清){
			this.hp满血值 += 10000 * _root.难度等级;
			this.hp += 10000 * _root.难度等级;
			this.防御力 += 200;
			this.空手攻击力 += 150 * _root.难度等级;
			this.韧性系数 += 20;
			this.称号 =  _root.战宠进阶函数.战马血清.称号;
		}
	}
}

_root.战宠进阶函数.钙化 = {
	名称:"钙化",
	初始化:null,
	消耗金币:300000,
	消耗K点:0,
	消耗道具:[],
	解锁等级:60,
	称号:"【钙化】",
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.钙化.解锁等级){
			return this.进阶方案.钙化.解锁等级 + "级以上可以进阶，提高生命值、防御力、韧性和属性抗性"
		}
		if(this.当前宠物属性.钙化){
			return "当前已完成进阶"
		}
		return "点击可进阶，提高生命值、防御力和属性抗性，需要消耗"+ this.进阶方案.钙化.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进阶能力",
	背景:"进化",
	详情页描述:function(){
		var 基础介绍 = "注入大量的复合元素，全面改造原有硅化外壳的构造，通过氟化钙防腐层、硅酸钙陶瓷层和致密的氟磷灰石内层与几丁质等基质构成了全新的甲壳，实现钙化-硅化-几丁质的协同作用，使得防护能力大幅增加。由于技术精密且复杂，原料成本也较高，因此该方案总价格高昂。可显著提高生命值、防御力、韧性和属性抗性。"
		if(this.当前宠物信息[1] < this.进阶方案.钙化.解锁等级){
			return 基础介绍 + "<br>"+this.进阶方案.钙化.解锁等级+"级以上可以进阶。"
		}
		if(this.当前宠物属性.钙化){
			return 基础介绍 + "<br>当前已完成进阶。"
		}
		return 基础介绍 + "<br>进阶需要消耗"+ this.进阶方案.钙化.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.钙化.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.钙化.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已进阶！");
		_root.金钱 -= this.进阶方案.钙化.消耗金币;
		this.当前宠物属性.钙化 = true;
	},
	单位进阶执行:function(){
		if(this.宠物属性.钙化){
			this.hp满血值 += 20000 * _root.难度等级;
			this.hp += 20000 * _root.难度等级;
			this.防御力 += 500;
			this.韧性系数 += 30;
			this.称号 =  _root.战宠进阶函数.钙化.称号;
			// this.魔法抗性 = {基础:60 + this.等级 * 0.3};
			this.提升属性抗性 = _root.敌人函数.提升属性抗性;
			this.提升属性抗性(50 + this.等级 * 0.2);
			this.已有称号 =  true;

			var param:Object = {
				亮度:200,
				对比度:200,
				饱和度:-100
			};

			this.dyeParam = param;
		}
	}
}