//基因虫
_root.敌人函数.基因虫兵种库 = [
	{兵种:"敌人-普通改造僵尸", 身高:175, 权重:2},
	{兵种:"敌人-兽化改造僵尸", 身高:175, 权重:2},
	{兵种:"敌人-普通爆炸僵尸", 身高:175, 权重:3},
	{兵种:"敌人-蛙型仿生僵尸", 身高:160, 权重:3},
	{兵种:"敌人-boss大僵尸", 身高:175, 权重:4},
	{兵种:"敌人-重型改造僵尸", 身高:175, 权重:4},
	{兵种:"敌人-普通基因虫", 身高:140, 权重:5},
	{兵种:"敌人-普通尸母", 身高:290, 权重:6}
];
//这边代码非常硬，后面做别的随机刷怪就不要抄这个了
_root.敌人函数.基因虫生成僵尸 = function(){
	var 兵种库 = _root.敌人函数.基因虫兵种库;
	var 总权重 = Math.floor(this.身高 / 50); //自然刷新的基因虫身高在150-290之间，即权重在3-5之间
	var 最大权重 = 总权重 > 6 ? 6 : 总权重;
	var 目标权重 = Math.floor(2 + random(最大权重 - 1));//从最小权重2到最大权重(2-6)之间随机选取一个权重
	var 生成数量;
	if(目标权重 == 5) {
		生成数量 = Math.floor((总权重 - 1) / 2); //硬代码让随机到权重5（小型基因虫）时分裂成多个
	}else {
		生成数量 = Math.floor((总权重 - 1) / 目标权重);
	}
	if(生成数量 < 1) 生成数量 = 1;//最小生成数量为1
	else if(生成数量 > 5) 生成数量 = 5;//最大生成数量为5
	var 目标权重兵种库 = [];
	for(var i=0; i<兵种库.length; i++){
		if(兵种库[i].权重 == 目标权重) 目标权重兵种库.push(兵种库[i]);
	}
	var offset = 生成数量 * 8;
	var 名字 = "基因变身怪";
	var 是否为敌人 = this.是否为敌人;
	for(var i=0; i<生成数量; i++){
		var 目标兵种 = 目标权重兵种库[random(目标权重兵种库.length)];
		var shootX = this._x + random(2 * offset + 1) - offset;
		var shootY = this._y + random(2 * offset + 1) - offset;
		var 僵尸型敌人newname = this._name + 目标兵种.兵种 + i;
		_root.加载游戏世界人物(目标兵种.兵种,僵尸型敌人newname,_root.gameworld.getNextHighestDepth(),{_x:shootX, _y:shootY, 等级:等级, 名字:名字, 是否为敌人:是否为敌人, 身高:目标兵种.身高, 长枪:"", 手枪:"", 手枪2:"", 刀:"", 手雷:""});
	}
};
