
_root.长枪配置 = function(目标, 长枪名, 强化等级)
{
	var 人物 = _root.gameworld[目标];
	人物.长枪 = 长枪名;
	人物.长枪属性数组 = _root.根据物品名查找全部属性(长枪名);
	人物.长枪属性数组[14][13] = _root.强化计算(人物.长枪属性数组[14][13], 强化等级);
	人物.长枪弹匣容量 = 人物.长枪属性数组[14][0];
	if(isNaN(人物.长枪射击次数[长枪名])) 人物.长枪射击次数[长枪名] = 0;
};

_root.手枪配置 = function(目标, 手枪名, 强化等级)
{
	var 人物 = _root.gameworld[目标];
	人物.手枪 = 手枪名;
	人物.手枪属性数组 = _root.根据物品名查找全部属性(手枪名);
	人物.手枪属性数组[14][13] = _root.强化计算(人物.手枪属性数组[14][13], 强化等级);
	人物.手枪弹匣容量 = 人物.手枪属性数组[14][0];
	if(isNaN(人物.手枪射击次数[手枪名])) 人物.手枪射击次数[手枪名] = 0;
};

_root.手枪2配置 = function(目标, 手枪2名, 强化等级)
{
	var 人物 = _root.gameworld[目标];
	人物.手枪2 = 手枪2名;
	人物.手枪2属性数组 = _root.根据物品名查找全部属性(手枪2名);
	人物.手枪2属性数组[14][13] = _root.强化计算(人物.手枪2属性数组[14][13], 强化等级);
	人物.手枪2弹匣容量 = 人物.手枪2属性数组[14][0];
	if(isNaN(人物.手枪2射击次数[手枪2名])) 人物.手枪2射击次数[手枪2名] = 0;
};

_root.手雷配置 = function(目标, 手雷名)
{
	var 人物 = _root.gameworld[目标];
	人物.手雷 = 手雷名;
	人物.手雷属性数组 = _root.根据物品名查找全部属性(手雷名);
};

_root.刀配置 = function(目标, 刀名, 强化等级)
{
	var 人物 = _root.gameworld[目标];
	人物.刀 = 刀名;
	人物.刀属性数组 = _root.根据物品名查找全部属性(刀名);
	人物.刀属性数组[13] = _root.强化计算(人物.刀属性数组[13], 强化等级);
};

_root.军牌配置 = function(目标, 军牌名)
{
	var 称号文本 = _root.获得翻译("菜鸟");
	var 人物 = _root.gameworld[目标];
	if (军牌名 != "")
	{
		称号文本 = _root.根据物品名查找属性(军牌名, 14)[0];
		var _loc5_ = 称号文本.indexOf(">") + 1;
		var _loc6_ = _loc5_ == 0 ? 称号文本.length - 1 : 称号文本.lastIndexOf("<") - 1;
		称号文本 = 称号文本.slice(0, _loc5_) + _root.获得翻译(称号文本.slice(_loc5_, _loc6_ + 1)) + 称号文本.slice(_loc6_ + 1, 称号文本.length);
	}
	人物.称号 = 称号文本;
	if (目标 == _root.控制目标)
	{
		_root.玩家称号 = 人物.称号;
	}
};
