_root.战宠进阶函数 = new Object();

var 无条件 = function(){
	return true;
}

_root.战宠进阶函数.凑数组的 = {
	初始化:null,
	描述:"",
	消耗金币:0,
	消耗K点:0,
	消耗道具:[],
	次数条件:0,
	次数上限:0,
	解锁等级:0,
	次数上限:false,
	条件:function(){
		return false;
	},
	执行:null,
	单位进阶执行:null
}

_root.战宠进阶函数.基础训练 = {
	初始化:null,
	消耗金币:25000,
	消耗K点:0,
	消耗道具:[],
	次数条件:0,
	次数上限:1,
	解锁等级:10,
	描述:function(){
		if(this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			return "十级以上可以进行基础训练，提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			return "已完成基础训练。基础训练可获得的属性提升达到上限"
		}
		return "点击可进行训练，需要消耗"+ this.进阶方案.基础训练.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"进行训练",
	背景:"生化",
	详情页描述:function(){
		var 基础介绍 = "对于基础体质较弱的单位可以进行一轮深度的基础训练，通过体能锻炼、功能性训练、健康理疗等途径提升身体强度，提高一定生命值、防御力和攻击力。"
		if(this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			return 基础介绍 + "<br>十级以上可以进行基础训练。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			return 基础介绍 + "<br>当前已完成基础训练，基础训练可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>进行基础训练需要消耗"+ this.进阶方案.基础训练.消耗金币+"金币。";
	},
	条件:function(){
		if( this.当前宠物信息[1] < this.进阶方案.基础训练.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.基础训练.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.基础训练.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成基础训练！");
		_root.金钱 -= this.进阶方案.基础训练.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:1,
				启用:true
			}
		}else if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数<1){
			this.当前宠物属性.基础训练.次数 = 1;
		}
		_root.宠物信息界面.排列宠物图标();
	},
	单位进阶执行:function(){
		if(this.宠物属性.基础训练 && this.宠物属性.基础训练.启用){
			if(this.宠物属性.基础训练.次数>=1){
				this.hp满血值 += 2000 * _root.难度等级;
				this.防御力 += 100;
				this.空手攻击力 += 30 * _root.难度等级;
				this.韧性系数 += 5;
			}
			if(this.宠物属性.基础训练.次数>=2){
				this.hp满血值 += 3500 * _root.难度等级;
				this.防御力 += 100;
				this.空手攻击力 += 100 * _root.难度等级;
				this.韧性系数 += 10;
			}
			if(this.宠物属性.基础训练.次数>=3){
				this.hp满血值 += 10000 * _root.难度等级;
				this.防御力 += 50;
				this.空手攻击力 += 150 * _root.难度等级;
				this.韧性系数 += 20;
			}
		}
	}
}

_root.战宠进阶函数.强化药剂 = {
	初始化:null,
	消耗金币:50000,
	消耗K点:0,
	消耗道具:[],
	次数条件:1,
	次数上限:2,
	解锁等级:25,
	描述:function(){
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return "基础体质不足以承受强化药剂，请先进行训练。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			return "二十五级以上可以注射强化药剂，提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			return "已注射强化药剂。强化药剂可获得的属性提升达到上限"
		}
		return "对于身体素质中等水平的单位可以注射强化药剂并进行适应性训练，进一步提高生命值、防御力和攻击力。点击可进行强化药剂注射与适应性训练，需要消耗"+ this.进阶方案.强化药剂.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"注射药剂",
	背景:"生化",
	详情页描述:function(){
		var 基础介绍 = "得益于统合政府主导下科研机构的广泛研究，及其积累的实验数据，我们得以在百废待兴的末世中回收利用先进的人体改造技术。<br>不同于传统意义上的义体改造或者基因改造，我们所利用的技术的原理是：利用投放物质的生化反应改造人体的生理活动，以充分激发人体潜能。因动物之间的生理活动相似性，该改造依然可以运用于其他种类的生物。该方案副作用小，技术可靠。";
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return 基础介绍 + "<br>当前体质不足以承受强化药剂，请先进行训练。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			return 基础介绍 + "<br>二十五级以上可以注射强化药剂。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			return 基础介绍 + "<br>当前已注射强化药剂，强化药剂可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>注射强化药剂与适应性训练共需要消耗"+ this.进阶方案.强化药剂.消耗金币+"金币。";
	},
	条件:function(){
		if(this.进阶方案.基础训练 && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.强化药剂.次数条件)){
			return false;
		}else if( this.当前宠物信息[1] < this.进阶方案.强化药剂.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.强化药剂.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.强化药剂.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成强化药剂注射与适应性训练！");
		_root.金钱 -= this.进阶方案.强化药剂.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:2,
				启用:true
			}
		}else if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数<2){
			this.当前宠物属性.基础训练.次数 = 2;
		}
		_root.宠物信息界面.排列宠物图标();
	},
	单位进阶执行:_root.战宠进阶函数.基础训练.单位进阶执行
}

_root.战宠进阶函数.超级血清 = {
	初始化:null,
	消耗金币:100000,
	消耗K点:0,
	消耗道具:[],
	次数条件:2,
	次数上限:3,
	解锁等级:50,
	描述:function(){
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件)){
			return "当前体质不足以承受超级血清，请先进行强化。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			return "五十级以上可以注射超级血清，进一步提升属性"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			return "已注射超级血清。超级血清可获得的属性提升达到上限"
		}
		return "对于身体素质较强的单位可以注射超级血清并进行适应性训练，显著提高生命值并增加一定防御力和攻击力。点击可进行超级血清注射与适应性训练，需要消耗"+ this.进阶方案.超级血清.消耗金币+"金币";
	},
	详情页:true,
	执行按钮文字:"注射血清",
	背景:"生化",
	详情页描述:function(){
		var 基础介绍 = "近期的实验表明，如果要通过生化反应这种方式制造超级战士，循序渐进的培养方案是最稳妥的。我们不能寄希望于速成，因为人体（以及其他动物的身体）必须适应药物带来的变化，这需要时间。此外，药物试验需要与之匹配的工业产能，这必然需要资金投入。从客户手中获取改造资金已是必然选择，该领域的商业化推广已是箭在弦上。";
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件)){
			return 基础介绍 + "<br>当前体质不足以承受超级血清，请先进行强化。";
		}
		if(this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			return 基础介绍 + "<br>五十级以上可以注射超级血清。"
		}
		if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			return 基础介绍 + "<br>当前已注射超级血清，超级血清可获得的属性提升达到上限。"
		}
		return 基础介绍 + "<br>注射超级血清与适应性训练共需要消耗需要消耗"+ this.进阶方案.超级血清.消耗金币+"金币。";
	},
	条件:function(){
		if((this.进阶方案.基础训练 || this.进阶方案.强化药剂) && (!this.当前宠物属性.基础训练 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数条件 )){
			return false;
		}else if( this.当前宠物信息[1] < this.进阶方案.超级血清.解锁等级){
			this.失败提示 = "";
			return false;
		}else if( _root.金钱 <= this.进阶方案.超级血清.消耗金币){
			this.失败提示 = "金币不足！";
			return false;
		}else if(this.当前宠物属性.基础训练 && this.当前宠物属性.基础训练.次数 >= this.进阶方案.超级血清.次数上限){
			//this.失败提示 = "训练次数已达到上限！";
			this.失败提示 = "";
			return false;
		}
		return true;
	},
	执行:function(){
		_root.最上层发布文字提示("已完成超级血清注射与适应性训练！");
		_root.金钱 -= this.进阶方案.超级血清.消耗金币;
		if(!this.当前宠物属性.基础训练){
			this.当前宠物属性.基础训练 = {
				次数:3,
				启用:true
			}
		}else if(!this.当前宠物属性.基础训练.次数 || this.当前宠物属性.基础训练.次数 < this.进阶方案.超级血清.次数上限){
			this.当前宠物属性.基础训练.次数 = this.进阶方案.超级血清.次数上限;
		}
		//_root.宠物信息界面["宠物信息显示框"+this.宠物信息数组号].宠物名 = "";
		_root.宠物信息界面.排列宠物图标();
	},
	单位进阶执行:_root.战宠进阶函数.基础训练.单位进阶执行
}


_root.战宠进阶函数.切换发型 = {
	初始化:function(){
		if(!this.当前宠物属性.发色){
			this.当前宠物属性.发色 = "橙";
		}
	},
	描述:function(){
		return "染发：当前为"+this.当前宠物属性.发色+"发";
	},
	消耗金币:0,
	消耗K点:0,
	消耗道具:[],
	次数条件:0,
	次数上限:false,
	条件:function(){
		return true;
	},
	执行:function(){
		if(this.当前宠物属性.发色=="橙"){
			this.当前宠物属性.发色="白";
		}else if(this.当前宠物属性.发色=="白"){
			this.当前宠物属性.发色="橙";
		}else{
			this.当前宠物属性.发色="白";
		}
   		_root.删除场景宠物();
   		_root.加载宠物(_root.gameworld[_root.控制目标]._x,_root.gameworld[_root.控制目标]._y);
		//this.JK.gotoAndStop(this.当前宠物属性.发色);
		_root.宠物信息界面["宠物信息显示框"+this.宠物信息数组号].宠物头像.JK.gotoAndStop(this.当前宠物属性.发色);
	}
}